{"symbol": "005930.KS", "name": "Samsung Electronics Co., Ltd.", "description": "Samsung Electronics Co., Ltd. engages in the consumer electronics, information technology and mobile communications, and device solutions businesses worldwide. It operates in four divisions such as DX, DS, SDC and Harman. The company offers smartphones, tablets, audio sounds, watches, switches, and accessories; TVs, and sound devices; appliances, including refrigerators, washing machines and dryers, vacuum cleaners, cooking appliances, dishwashers, air conditioners, and air purifiers; monitors and memory storage products; displays, and smart and LED signages; and other accessories. It also engages in venture capital investments, cloud services, network devices installation, semiconductor equipment services, digital advertising platforms, marketing, consulting, connected services provider, logistics, financing, and software design activities; toll processing and sales of semiconductors and display panels; development and sale of network solutions; manufacture of semiconductors and food; the provision of repair services for electronic devices; and development and supply of semiconductor process defect and quality control software, as well as digital televisions, foundry, system large scale integration LSI, connected car systems, audio and visual products, enterprise automation solutions, and connected services. The company was incorporated in 1969 and is based in Suwon, South Korea.", "sector": "Technology", "industry": "Consumer Electronics", "employees": null, "website": "https://www.samsung.com", "city": "Suwon", "country": "South Korea", "currency": "KRW", "marketCap": 995557782847488, "trailingPE": null, "forwardPE": 8.416963, "trailingEps": null, "dividendYield": 0.99, "dividendRate": 1480.0, "priceToBook": null, "profitMargins": 0.103140004, "beta": 0.827, "fiftyTwoWeekHigh": 149500.0, "fiftyTwoWeekLow": 50800.0, "averageVolume": 23641924, "totalRevenue": 315556850827264, "grossProfits": 115638890659840, "totalCash": 108463829024768, "totalDebt": 16672279756800, "ebitda": 74998802808832, "lastUpdated": "2026-01-18T13:31:59.001673Z"}