{"symbol": "051910.KS", "name": "LG Chem, Ltd.", "description": "LG Chem, Ltd., together with its subsidiaries, engages in the petrochemicals, energy, advanced materials, and life science businesses in Korea, China, Asia/Oceania, the United States, Europe, and internationally. It provides acrylonitrile and methacrylate butadiene styrene, acrylonitrile styrene acrylate, acrylate, aerogel, alcohol, anode binder, bisphenol a, butadiene rubber, carbon nanotubes, caustic soda, expandable polystyrene, ethylene vinyl acetate, high and low density polyethylene, isopropyl alcohol, nitrile butadiene rubber latex, neopentyl glycol, polycarbonate, polyolefin elastomer, polypropylene, polystyrene, polyvinyl chloride, plasticizers, polymer catalysts, styrene acrylonitrile copolymer, super absorbent polymer, styrene butadiene latex and styrene, solution styrene butadiene rubber, metallocene PE, and process catalysts, as well as COMPOSTFUL, a compostable material solution. The company also offers adhesive, wafer backside grinding tapes, copper clad laminate/pre preg, cathode materials, die attach films, dispersant for conductive agent, display strippers, double-sided tapes, flame barrier material, thermoplastic elastomers, engineering plastic, engineering plastic compound, thermoplastic engineering plastic, OLED materials, reverse osmosis membranes, and separators. In addition, it provides life sciences products for arthritis, diabetes, growth hormone, circulatory system, fertility, anemia, hyperkalemia, urinary system, anti-adhesive agent, antimicrobials, anti-cancer treatment assistance, bovine somatotropin, vaccines, neuropathic pain, dermal filler, crop protection agents, and deoxycholic acid. LG Chem, Ltd. was founded in 1947 and is headquartered in Seoul, South Korea.", "sector": "Basic Materials", "industry": "Chemicals", "employees": null, "website": "https://www.lgchem.com", "city": "Seoul", "country": "South Korea", "currency": "KRW", "marketCap": 26104746213376, "trailingPE": null, "forwardPE": 22.310677, "trailingEps": null, "dividendYield": 0.3, "dividendRate": 1000.0, "priceToBook": null, "profitMargins": -0.03129, "beta": 1.26, "fiftyTwoWeekHigh": 428500.0, "fiftyTwoWeekLow": 181500.0, "averageVolume": 342229, "totalRevenue": 47232770375680, "grossProfits": 7843342188544, "totalCash": 8598626762752, "totalDebt": 33587489406976, "ebitda": 6268190195712, "lastUpdated": "2026-01-18T13:32:00.919137Z"}