{"symbol": "1010.SR", "name": "Riyad Bank", "description": "Riyad Bank provides banking and investment services in the Kingdom of Saudi Arabia. It operates through Retail Banking, Investment Banking and Brokerage, Corporate Banking, and Treasury and Investments segments. The Retail Banking segment offers deposits, credit, and investment products for individuals. The Corporate Banking segment offers current accounts, deposits, loans, overdrafts, and other credit facilities for small to medium sized businesses. The Treasury and Investments segment offers money market, trading, and treasury and derivative products and services, as well as manages investment portfolios. The Investment Banking and Brokerage segment provides investment management services; and asset management services related to dealing, managing, arranging, advising, and custody of securities. The company also provides credit cards; trade finance, payroll solution, point of sale; and cash deposit card; student account; time deposit; sweeping; personal, auto-lease, readymade and incomplete property, home equity, self-employed, and mortgage loans; working capital, contract, capital expenditure, and project financing; syndicated loan; Islamic banking products and services; foreign exchange products; and digital banking services. In addition, it owns, buys, and sells real estate; and acts as an agent for insurance products, as well as engages in the systems analysis, application, operating systems development, hosting websites, financial technology solutions, and related activities. The company operates through a network of branches in the Kingdom of Saudi Arabia, the United Kingdom, the United States; and representative office in Singapore and ATMs. Riyad Bank was incorporated in 1957 and is based in Riyadh, the Kingdom of Saudi Arabia.", "sector": "Financial Services", "industry": "Banks - Regional", "employees": 6087, "website": "https://www.riyadbank.com", "city": "Riyadh", "country": "Saudi Arabia", "currency": "SAR", "marketCap": 80266731520, "trailingPE": 8.375, "forwardPE": 9.2733555, "trailingEps": 3.2, "dividendYield": 6.35, "dividendRate": 1.7, "priceToBook": 1.3004028, "profitMargins": 0.60299, "beta": 0.23, "fiftyTwoWeekHigh": 33.2, "fiftyTwoWeekLow": 25.3, "averageVolume": 1816718, "totalRevenue": 16629397504, "grossProfits": 16629397504, "totalCash": 40531689472, "totalDebt": 41888575488, "ebitda": null, "lastUpdated": "2026-01-18T13:26:35.805805Z"}