{"symbol": "1060.SR", "name": "Saudi Awwal Bank", "description": "Saudi Awwal Bank, together with its subsidiaries, provides banking and financial services in the Kingdom of Saudi Arabia. The company operates through Wealth & Personal Banking, Corporate and Institutional Banking, Treasury, Capital Markets, and Others segments. It offers personal and business savings, current, commodity investment, wafer accounts, and green deposit account; personal and home financing; credit, debit, business, and prepaid cards; wealth management solutions; investment solutions; payments and transfer services; e-statement, treasury, and private banking services; safe deposit lockers; and online, mobile, and phone banking services. The company also provides liquidity and cash management services, including liquidity, collection, and payment management services, and point of sale services; and trade and receivables finance services, which include export and import services, guarantees, structured trade solutions; and foreign exchange, derivative solutions, deposits and loans, bonds, fixed income, structured products, and Islamic solutions, as well as economic research and market analysis. In addition, it engages in the dealing, managing, arranging, advising, and taking custody of securities; real estate activities; and trading of derivatives and repo activities. The company was formerly known as Saudi British Bank and changed its name to Saudi Awwal Bank in June 2023. Saudi Awwal Bank was founded in 1978 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.", "sector": "Financial Services", "industry": "Banks - Regional", "employees": 4470, "website": "https://www.sab.com", "city": "Riyadh", "country": "Saudi Arabia", "currency": "SAR", "marketCap": 69452054528, "trailingPE": 8.600509, "forwardPE": 8.535354, "trailingEps": 3.93, "dividendYield": 5.99, "dividendRate": 2.0, "priceToBook": 1.0577705, "profitMargins": 0.60780996, "beta": 0.236, "fiftyTwoWeekHigh": 38.0, "fiftyTwoWeekLow": 29.9, "averageVolume": 1410425, "totalRevenue": 14036434944, "grossProfits": 14036434944, "totalCash": 10669202432, "totalDebt": 35118919680, "ebitda": null, "lastUpdated": "2026-01-18T13:26:48.484452Z"}