{"symbol": "1140.SR", "name": "Bank Albilad", "description": "Bank Albilad, through its subsidiaries, provides various banking products and services in the Kingdom of Saudi Arabia. The company operates in four segments: Retail Banking, Corporate Banking, Treasury, and Investment Banking and Brokerage. It offers current, savings, albilad, tamayuz, corporate, and SME current accounts; personal financing products, such as shares financing, top-up financing, refinancing, buyout programs, and finance against mortgage; real estate financing products; auto financing and leasing products; remittances; currency exchange services; corporate financing solutions, which include working capital, asset, and contract financing; overdrafts; and structured finance products. The company also provides cash management solutions; trade finance products comprising letters of guarantee, letters of credit, documentary collection, and Musharakah financing; money market; treasury services consisting of direct investment and foreign exchange services; SME financing solutions; SME programs, such as customs clearance, hajj and omrah, POS financing, franchise, contracts financing, and payroll financing programs; point of sale services; e-commerce payment platforms; investment management and asset management; and payroll services and wage protection systems. In addition, it offers credit, debit, and prepaid cards; and internet and online banking services. The company was incorporated in 2004 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.", "sector": "Financial Services", "industry": "Banks - Regional", "employees": 3767, "website": "https://www.bankalbilad.com", "city": "Riyadh", "country": "Saudi Arabia", "currency": "SAR", "marketCap": 36855001088, "trailingPE": 12.103448, "forwardPE": 9.523256, "trailingEps": 2.03, "dividendYield": 3.57, "dividendRate": 0.87, "priceToBook": 1.7659743, "profitMargins": 0.50895, "beta": 0.614, "fiftyTwoWeekHigh": 33.875, "fiftyTwoWeekLow": 23.38, "averageVolume": 1424894, "totalRevenue": 5938929152, "grossProfits": 5938929152, "totalCash": 7724184064, "totalDebt": 3145747968, "ebitda": null, "lastUpdated": "2026-01-18T09:11:23.519538Z"}