{"symbol": "1150.SR", "name": "Alinma Bank", "description": "Alinma Bank provides banking and investment services in the Kingdom of Saudi Arabia. It operates through Retail Banking, Corporate Banking, Treasury, and Investment and Brokerage segments. The company provides various banking services, including current, education, and family accounts; self-service banking services; debit, credit, traveler, purchase, and prepaid cards; point of sale services; car, real estate, personal, and education financing, as well as SME, kafalah program, business payroll, assets, business invoices, and receivables financing; and bill payment services. It also offers treasury, letters of guarantee, documentary collection, import and export letters of credit, and guarantee verification services; cash management services; corporate partner services; financing and investment products; financial services; and payroll management and e-payment gateway services. In addition, the company provides investment management, asset management, custodianship, advisory, underwriting, and brokerage services; and operates as an insurance agent. Further, it offers digital banking services. The company provides its services to individuals, corporates, SMEs, and institutional customers. The company was founded in 2006 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.", "sector": "Financial Services", "industry": "Banks - Regional", "employees": 4174, "website": "https://www.alinma.com", "city": "Riyadh", "country": "Saudi Arabia", "currency": "SAR", "marketCap": 66076463104, "trailingPE": 11.465518, "forwardPE": 11.271187, "trailingEps": 2.32, "dividendYield": 4.58, "dividendRate": 1.2, "priceToBook": 1.8918918, "profitMargins": 0.58922, "beta": 0.069, "fiftyTwoWeekHigh": 31.3, "fiftyTwoWeekLow": 23.94, "averageVolume": 4986445, "totalRevenue": 10526167040, "grossProfits": 10526167040, "totalCash": 12278881280, "totalDebt": 13498072064, "ebitda": null, "lastUpdated": "2026-01-18T09:11:14.655919Z"}