{"symbol": "1211.SR", "name": "Saudi Arabian Mining Company (Ma'aden)", "description": "Saudi Arabian Mining Company (Ma'aden), together with its subsidiaries, operates as a mining and metals company in the Kingdom of Saudi Arabia, India, Pakistan, Bangladesh, Singapore, Korea, the United States, Europe, Australia, Brazil, Africa, GCC, and internationally. The company operates through Phosphate Strategic Business Unit, Aluminium Strategic Business Unit, Base Metals and New Minerals Strategic Business Unit, and All other segments. It primarily mines for gold, phosphate rock, bauxite, kaolin, and magnesite, as well as copper, zinc, and silver concentrates. The company principally holds interests in the e Mansourah-Massarah, Mahd Ad-Dahab, Bulghah, Al-Amar, Sukhaybarat, As Suq, Ad Duwayhi, Al-Jalamid, Al-Khabra, Az Zabirah, Al-Ghazallah, and Al-Ba'itha mines. It also produces and sells phosphate fertilizers, natural potassium minerals, nitric acid, ammonia, potassium nitrate, and industrial minerals, as well as alumina, aluminum, and flat rolled products directly to customers and through marketing agents. In addition, the company offers ingots, slabs, sheets, and billets; caustic soda and Ethylene Dichloride (EDC); and urea, phosphate, and potassium fertilizers, as well as manages, develops, constructs, and operates infrastructure projects. Saudi Arabian Mining Company (Ma'aden) was founded in 1997 and is based in Riyadh, the Kingdom of Saudi Arabia.", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "employees": null, "website": "https://www.maaden.com.sa", "city": "Riyadh", "country": "Saudi Arabia", "currency": "SAR", "price": 72.3499984741211, "change": 1.0499954223632812, "changePercent": 1.472644288109038, "dayLow": 71.5, "dayHigh": 72.55000305175781, "volume": 1559054, "open": 71.5, "previousClose": 71.30000305175781, "marketCap": 280782864384, "trailingPE": 47.287582, "forwardPE": 46.67742, "trailingEps": 1.53, "dividendYield": null, "dividendRate": null, "priceToBook": 4.6937847, "profitMargins": 0.14696999, "beta": 0.323, "fiftyTwoWeekHigh": 72.55, "fiftyTwoWeekLow": 37.85, "averageVolume": 1558349, "totalRevenue": 37907185664, "grossProfits": 14353636352, "totalCash": 10889515008, "totalDebt": 34997878784, "ebitda": 14179144704, "lastUpdated": "2026-01-18T14:08:31.336647Z"}