{"symbol": "2222.SR", "name": "Saudi Arabian Oil Company", "description": "Saudi Arabian Oil Company operates as an integrated energy and chemical company in the Kingdom of Saudi Arabia and internationally. The company operates through two segments, Upstream and Downstream. The Upstream segment explores, develops, produces, and sells crude oil, condensate, natural gas, and natural gas liquids (NGLs). The Downstream segment produces various chemicals, such as aromatics, olefins, and polyolefins; polyols, isocyanates, and synthetic rubber; methanol, MTBE, glycols, linear alpha olefins, polyethylene, polypropylene, polyethylene terephthalate, polyvinyl chloride, polystyrene, polycarbonate, and engineering thermoplastics and their blends; and lubricants and base oils, as well as engages in the refining and petrochemicals, retail operations, distribution, supply and trading, and power generation. It also markets and distributes hydrocarbons, petroleum products; and trades crude oil, refined petroleum, and liquid chemical products. In addition, the company develops, manufactures, and markets high-performance rubber; and provides crude oil storage, investment, consulting, information technology, personnel and other support, agri-nutrients, purchasing, engineering, benefits administration, oil field, insurance, pipeline transport, vendor sourcing, marketing and sales support, financing, support, and marine management and transportation services. Further, it engages in aircraft operations and leasing; aviation; sports club; retail fuel marketing and operations; investment management of post-employment benefit plans; wholesale fuel operations; importing and exporting refined products and crude oil; and real estate holdings. Additionally, the company engages in prospecting, exploring, drilling, processing, manufacturing, refining, extracting, and marketing hydrocarbon substances. Saudi Arabian Oil Company was founded in 1933 and is headquartered in Dhahran, the Kingdom of Saudi Arabia.", "sector": "Energy", "industry": "Oil & Gas Integrated", "employees": null, "website": "https://www.aramco.com", "city": "Dhahran", "country": "Saudi Arabia", "currency": "SAR", "marketCap": 6041530007552, "trailingPE": 16.543047, "forwardPE": 14.958084, "trailingEps": 1.51, "dividendYield": 5.29, "dividendRate": 1.31, "priceToBook": 4.0492783, "profitMargins": 0.21700001, "beta": 0.046, "fiftyTwoWeekHigh": 28.25, "fiftyTwoWeekLow": 23.04, "averageVolume": 10072651, "totalRevenue": 1683505020928, "grossProfits": 930603008000, "totalCash": 232504000512, "totalDebt": 356552015872, "ebitda": 815800975360, "lastUpdated": "2026-01-18T13:26:39.361788Z"}