{"symbol": "2380.SR", "name": "Rabigh Refining and Petrochemical Company", "description": "Rabigh Refining and Petrochemical Company engages in the development, construction, and operation of an integrated refining and petrochemical complex in the Middle East, the Asia Pacific, and internationally. The company operates in Refined Products and Petrochemicals segments. It offers polymers, such as high-density polyethylene, polypropylene homo polymer, block copolymer polypropylene, linear low-density polyethylene, ethylene vinyl acetate, ethylene propylene diene rubber, termo plastic olefin, poly methyl methacrylate, and polyamide 6. The company also provides mono ethylene glycol, propylene oxide, methyl methacrylate, phenol, acetone, para xylene, and benzen monomer related products. In addition, it offers fuel oil, diesel, gasoline, kerosene, light naphtha, and liquefied petroleum gas. Its products are used in various end products, such as plastics, detergents, lubricants, resins, coolants, anti-freeze, paint, carpets, rope, clothing, shampoo, auto interiors, epoxy glue, insulation, film, fibers, household appliances, packaging, candles, pipes, and other applications. The company was incorporated in 2005 and is headquartered in Rabigh, the Kingdom of Saudi Arabia. As of October 9, 2025 Rabigh Refining and Petrochemical Company act as subsidiary of Saudi Arabian Oil Company.", "sector": "Energy", "industry": "Oil & Gas Refining & Marketing", "employees": null, "website": "https://www.petrorabigh.com", "city": "Rabigh", "country": "Saudi Arabia", "currency": "SAR", "marketCap": 14876161024, "trailingPE": null, "forwardPE": -5.54918, "trailingEps": -2.44, "dividendYield": null, "dividendRate": null, "priceToBook": 1.349143, "profitMargins": -0.11237001, "beta": 0.228, "fiftyTwoWeekHigh": 9.48, "fiftyTwoWeekLow": 6.26, "averageVolume": 2293200, "totalRevenue": 36235423744, "grossProfits": -1230748032, "totalCash": 578356992, "totalDebt": 31963736064, "ebitda": -773395968, "lastUpdated": "2026-01-18T13:26:58.578779Z"}