{"symbol": "4001.SR", "name": "Abdullah Al-Othaim Markets Company", "description": "Abdullah Al-Othaim Markets Company, together with its subsidiaries, engages in the wholesale and retail trade of food supplies and other products in the Kingdom of Saudi Arabia and Arab Republic of Egypt. It operates through Retail and Wholesale Trade, Real Estate and Rental, and Other segments. The company wholesales and retails food, fish, meat, agricultural products, livestock, and household items; and involved in establishing, managing, operating, and maintaining central markets, shopping malls, and bakeries, offering cooked and uncooked catering services, as well as manages training and educational centers. It also acquires lands to construct buildings for lease or sale. In addition, the company imports and exports fruits, vegetables, dairy products, olive, ghee, halawa, pasta, and soft drinks; ready-made garments, sportswear, jewelry, sewing tools, bags, leather products, decorations, dropped ceilings, and vehicles spare parts. Further, the company sells, rents, and exploits real estate properties and lands; as well as offers computer services; and maintenance of training and entertainment, and sports centers. Additionally, it establishes agriculture projects; manages bakeries and cafes; and undertakes general contracting services. Furthermore, the company involved in the construction, maintenance, demolition, and restoration of electrical, and electronic works, as well as cultivates vegetables and fodder; and operates commercial complexes. It also offers poultry, as well as labor, import and export, and marketing services. Abdullah Al-Othaim Markets Company was founded in 1956 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.", "sector": "Consumer Defensive", "industry": "Grocery Stores", "employees": null, "website": "https://www.othaimmarkets.com", "city": "Riyadh", "country": "Saudi Arabia", "currency": "SAR", "price": 6.300000190734863, "change": -0.009999752044677734, "changePercent": -0.15847467726398848, "dayLow": 6.300000190734863, "dayHigh": 6.409999847412109, "volume": 1422962, "open": 6.300000190734863, "previousClose": 6.309999942779541, "marketCap": 5670000128, "trailingPE": 13.404256, "forwardPE": 12.857143, "trailingEps": 0.47, "dividendYield": 7.29, "dividendRate": 0.46, "priceToBook": 4.712042, "profitMargins": 0.038110003, "beta": 0.222, "fiftyTwoWeekHigh": 10.82, "fiftyTwoWeekLow": 6.0, "averageVolume": 1319299, "totalRevenue": 11034520576, "grossProfits": 2416181504, "totalCash": 112676904, "totalDebt": 2902464256, "ebitda": 602570176, "lastUpdated": "2026-01-18T14:08:33.593474Z"}