{"symbol": "4002.SR", "name": "Mouwasat Medical Services Company", "description": "Mouwasat Medical Services Company, together with its subsidiaries, engages in the acquisition, management, operation, and maintenance of hospitals, medical centers, drug stores, and pharmacies in the Kingdom of Saudi Arabia. The company operates a network of hospitals that provides medical services; and specialized centers, including eye, long term, rehabilitation, and cardiology centers, as well as stroke unit, nuclear medicine, fertility, diabetes and diabetic foot, skin care, and badana clinic. It also provides various services comprising inpatient pharmacy services, TPN and IV medication preparation units, chemotherapy medication preparation, anti-coagulant clinic, and clinical pharmacy services. In addition, the company is involved in construction and operation of hospitals, dispensaries, and special clinics; general construction of non-residential buildings including schools, hospitals, and hotels; demolition of buildings; purchase, sale, and division of land and real estate, and off-plan sales activities; operation of colleges and university institutes; and medical operation activities. Further, it wholesales medical equipment and drugs. Mouwasat Medical Services Company was founded in 1974 and is based in Dammam, the Kingdom of Saudi Arabia.", "sector": "Healthcare", "industry": "Medical Care Facilities", "employees": null, "website": "https://www.mouwasat.com", "city": "Dammam", "country": "Saudi Arabia", "currency": "SAR", "price": 67.05000305175781, "change": 0.350006103515625, "changePercent": 0.5247468058914943, "dayLow": 66.8499984741211, "dayHigh": 67.25, "volume": 193972, "open": 66.8499984741211, "previousClose": 66.69999694824219, "marketCap": 13410000896, "trailingPE": 17.738096, "forwardPE": 15.27335, "trailingEps": 3.78, "dividendYield": 4.5, "dividendRate": 3.0, "priceToBook": 3.5740938, "profitMargins": 0.24422, "beta": 0.392, "fiftyTwoWeekHigh": 93.7, "fiftyTwoWeekLow": 65.1, "averageVolume": 388655, "totalRevenue": 3093573376, "grossProfits": 1322524928, "totalCash": 576030400, "totalDebt": 1065918400, "ebitda": 1052938368, "lastUpdated": "2026-01-18T14:08:48.574813Z"}