{"symbol": "6098.T", "name": "Recruit Holdings Co., Ltd.", "description": "Recruit Holdings Co., Ltd. provides HR technology and business solutions that transforms the world of work. It operates through three segments: HR Technology, Matching & Solutions, and Staffing. The HR Technology segment provides online matching and hiring platforms where people can find jobs and learn about companies. The Matching & Solutions segment offers HR solutions that support business clients' recruiting and hiring activities and individual users' job search activities through its job advertising services and placement services. This segment also provides marketing solutions that provide matching platforms for businesses in various industries, including beauty, travel, dining, and SaaS solutions as lifestyle; housing and real estate; and other services in marketing solutions. The Staffing segment provides temporary staffing services in Japan, Europe, the United States, and Australia. Recruit Holdings Co., Ltd. operates in more than 60 countries. The company was formerly known as Recruit Co., Ltd. and changed its name to Recruit Holdings Co., Ltd. in October 2012. Recruit Holdings Co., Ltd. was founded in 1960 and is headquartered in Tokyo, Japan.", "sector": "Communication Services", "industry": "Internet Content & Information", "employees": 49480, "website": "https://recruit-holdings.com/en", "city": "Tokyo", "country": "Japan", "currency": "JPY", "price": 9191.0, "change": -49.0, "changePercent": -0.5303030303030304, "dayLow": 9099.0, "dayHigh": 9288.0, "volume": 3041000, "open": 9102.0, "previousClose": 9240.0, "marketCap": 12915627261952, "trailingPE": 30.95968, "forwardPE": 30.370419, "trailingEps": 296.87, "dividendYield": 0.27, "dividendRate": 25.0, "priceToBook": 8.880253, "profitMargins": 0.122279994, "beta": 0.994, "fiftyTwoWeekHigh": 11230.0, "fiftyTwoWeekLow": 6050.0, "averageVolume": 4736489, "totalRevenue": 3552357122048, "grossProfits": 2092909985792, "totalCash": 535094984704, "totalDebt": 188473999360, "ebitda": 598733029376, "lastUpdated": "2026-01-18T14:10:51.721883Z"}