{"symbol": "7010.SR", "name": "Saudi Telecom Company", "description": "Saudi Telecom Company, together with its subsidiaries, provides telecommunications, information, media, and digital payment services in the Kingdom of Saudi Arabia and internationally. The company establishes, manages, operates, and maintains fixed and mobile telecommunication networks, systems, and infrastructures; delivers, provides, maintains, and manages diverse telecommunication and information technology (IT) services; prepares, plans, and studies for technical, financial, and administrative aspects of telecommunication and IT services; expands and develops telecommunication networks, systems, and infrastructure; provides transfer of internet services; and wholesales and retails, imports, exports, purchases, owns, leases, manufactures, promotes, sells, develops, designs, setups, and maintains devices, equipment, and components. It also provides consultancy services; integrated communication and information technology solutions, including telecom, IT services, managed services, cloud services, and internet of things, etc.; information-based systems and technologies; financial and managerial support and other services; development, training, asset management, and other related services; solutions for decision support, business intelligence, and data investment; supply chain and other related services; and digital banking and cybersecurity services. In addition, the company engages in the selling, buying, leasing, managing, developing, and maintenance of real estate properties; and construction, maintenance, and repair of telecommunication, and radar stations and towers. Saudi Telecom Company was founded in 1998 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.", "sector": "Communication Services", "industry": "Telecom Services", "employees": null, "website": "https://www.stc.com.sa", "city": "Riyadh", "country": "Saudi Arabia", "currency": "SAR", "price": 44.0, "change": -0.2999992370605469, "changePercent": -0.6771991923863808, "dayLow": 43.939998626708984, "dayHigh": 44.380001068115234, "volume": 2271536, "open": 44.18000030517578, "previousClose": 44.29999923706055, "marketCap": 219550924800, "trailingPE": 18.644068, "forwardPE": 15.438597, "trailingEps": 2.36, "dividendYield": 4.97, "dividendRate": 2.2, "priceToBook": 2.6153116, "profitMargins": 0.32365, "beta": 0.237, "fiftyTwoWeekHigh": 48.3, "fiftyTwoWeekLow": 40.7, "averageVolume": 2677254, "totalRevenue": 77352861696, "grossProfits": 36660928512, "totalCash": 19412930560, "totalDebt": 17271885824, "ebitda": 21434656768, "lastUpdated": "2026-01-18T14:08:55.079693Z"}