{"symbol": "7200.SR", "name": "Al Moammar Information Systems Company", "description": "Al Moammar Information Systems Company provides information technology solutions and services in the Kingdom of Saudi Arabia. It operates in seven segments: Business Service Management Unit, Solutions Unit, Systems Unit, Information Technology Security Unit, Networking Unit, Operation and Maintenance Unit, and Data Center Unit. It offers managed healthcare, people, and medical services; SLA support; MDR; SOC services; and managed IT, consulting, professional, and project management services. The company also provides various data analytics and artificial intelligence solutions; data-driven applications that include ERP and CRM, banking and medical applications, anti-money laundering, geographic information systems, industry applications, environmental applications and forecast, business process management, AI chatbots, mobile, and web applications; and digital platforms, including marketplace and e-commerce, search engine, payment, communication, digital retail, supply chain, smart city, and digital banking and health platforms. In addition, it offers cyber security solutions; web hosting; software solutions, including software-defined networking, WAN, and access, as well as network automation and analytics, private 5G, Wi-Fi 6/6E, application delivery controller, and monitoring and management; and collaboration solutions, such as unified communications, collaboration touchpoints, conferencing and messaging, workspaces, and contact center; and UC applications, analytics, and cloud solutions. Further, the company provides medical devices and laboratory products, as well as operates tele-care and telemedicine centers, canteens or cafeterias, and storage of medical waste. It serves transport, logistics, entertainment, manufacturing, sales, healthcare, education, energy and services, and telecommunication industries; and governments, cities, financial resources, and banks. The company was incorporated in 1979 and is headquartered in Riyadh, the Kingdom of Saudi Arabia.", "sector": "Technology", "industry": "Information Technology Services", "employees": null, "website": "https://www.mis.com.sa", "city": "Riyadh", "country": "Saudi Arabia", "currency": "SAR", "marketCap": 5070000128, "trailingPE": 53.821655, "forwardPE": 44.473686, "trailingEps": 3.14, "dividendYield": 3.35, "dividendRate": 5.6, "priceToBook": 13.013013, "profitMargins": 0.07552, "beta": 0.38, "fiftyTwoWeekHigh": 176.8, "fiftyTwoWeekLow": 118.0, "averageVolume": 81708, "totalRevenue": 1245679872, "grossProfits": 288213472, "totalCash": 63054248, "totalDebt": 1252492288, "ebitda": 119587176, "lastUpdated": "2026-01-18T13:26:27.015462Z"}