{"symbol": "9984.T", "name": "SoftBank Group Corp.", "description": "SoftBank Group Corp. provides telecommunication services in Japan and internationally. It operates through Investment Business of Holding Companies, SoftBank Vision Funds, SoftBank, Arm, and Other segments. The company offers mobile communications and solutions to enterprise customers, and broadband services to retail customers; and sells mobile devices and software tools, as well as related services. It also provides online advertising and e-commerce services; payment and financial services; information and communication technology services products to enterprise customers; and communication device-related products and Internet of Things equipment to retail customers. In addition, the company engages in the design of microprocessor intellectual property and related technology; alternative investment management; ownership of professional baseball team; operation of baseball games; management and maintenance of baseball stadium and other sports facilities; and distribution of video, voice, and data content via media businesses. Further, it is involved in the certification services, security solutions, and Linux/OSS businesses; operation of comprehensive IT information site ITmedia; internet advertising agency business; sale of indirect materials, such as consumable supplies; facility management; operation of StoreMatch, an online advertising distribution service; planning and operation of fashion e-commerce website; operational support of brands' own e-commerce website; operation of fashion coordination app; banking; mail order sale of stationery and services; and provision of autonomous forklifts. The company was formerly known as SoftBank Corp. and changed its name to SoftBank Group Corp. in July 2015. SoftBank Group Corp. was incorporated in 1981 and is headquartered in Tokyo, Japan.", "sector": "Communication Services", "industry": "Telecom Services", "employees": 67229, "website": "https://group.softbank", "city": "Tokyo", "country": "Japan", "currency": "JPY", "price": 4010.0, "change": -41.0, "changePercent": -1.0120957788200444, "dayLow": 4010.0, "dayHigh": 4133.0, "volume": 35301000, "open": 4080.0, "previousClose": 4051.0, "marketCap": 22904511135744, "trailingPE": 7.496308, "forwardPE": 13.57987, "trailingEps": 534.93, "dividendYield": 0.27, "dividendRate": 11.0, "priceToBook": 1.5991724, "profitMargins": 0.40903, "beta": 0.697, "fiftyTwoWeekHigh": 6923.75, "fiftyTwoWeekLow": 1432.5, "averageVolume": 85965742, "totalRevenue": 7510673063936, "grossProfits": 3863291887616, "totalCash": 4980830896128, "totalDebt": 20120304877568, "ebitda": 1541632032768, "lastUpdated": "2026-01-18T14:10:45.047444Z"}