{"symbol": "AMZN", "name": "Amazon.com, Inc.", "description": "Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, fire tablets, fire TVs, echo, ring, blink, and eero; and develops and produces media content. In addition, the company offers programs that enable sellers to sell their products in its stores; and programs that allow authors, independent publishers, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, it provides compute, storage, database, analytics, machine learning, and other services, as well as advertising services through programs, such as sponsored ads, display, and video advertising. Additionally, the company offers Amazon Prime, a membership program. The company's products offered through its stores include merchandise and content purchased for resale and products offered by third-party sellers. It also provides AgentCore services, such as AgentCore Runtime, AgentCore Memory, AgentCore Observability, AgentCore Identity, AgentCore Gateway, AgentCore Browser, and AgentCore Code Interpreter. It serves consumers, sellers, developers, enterprises, content creators, advertisers, and employees. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.", "sector": "Consumer Cyclical", "industry": "Internet Retail", "employees": 1578000, "website": "https://www.amazon.com", "city": "Seattle", "country": "United States", "currency": "USD", "marketCap": 2556244262912, "trailingPE": 33.77401, "forwardPE": 30.41825, "trailingEps": 7.08, "dividendYield": null, "dividendRate": null, "priceToBook": 6.91358, "profitMargins": 0.11063, "beta": 1.376, "fiftyTwoWeekHigh": 258.6, "fiftyTwoWeekLow": 161.38, "averageVolume": 44772259, "totalRevenue": 691330023424, "grossProfits": 345982009344, "totalCash": 94196998144, "totalDebt": 160437993472, "ebitda": 139696996352, "lastUpdated": "2026-01-18T13:27:44.530742Z"}