{"symbol": "ASML.AS", "name": "ASML Holding N.V.", "description": "ASML Holding N.V. provides lithography solutions for the development, production, marketing, sales, upgrading, and servicing of advanced semiconductor equipment systems. It offers lithography, metrology, and inspection systems. The company also provides extreme ultraviolet lithography systems; and deep ultraviolet lithography systems comprising immersion and dry lithography systems solutions to manufacture various range of semiconductor nodes and technologies. In addition, it offers metrology and inspection systems, including YieldStar optical metrology systems to assess the quality of patterns on the wafers; and HMI electron beam solutions to identify and analyze individual chip defects. Further, the company provides computational lithography solutions, and lithography systems and control software solutions; and refurbishes and upgrades lithography systems, as well as offers customer support and related services. Additionally, it offers hardware, software, and services to chipmakers to produce the patterns of integrated circuits. The company operates in Japan, South Korea, Singapore, Taiwan, China, rest of Asia, the Netherlands, rest of Europe, the Middle East, Africa, and the United States. The company was formerly known as ASM Lithography Holding N.V. and changed its name to ASML Holding N.V. in 2001. ASML Holding N.V. was founded in 1984 and is headquartered in Veldhoven, the Netherlands.", "sector": "Technology", "industry": "Semiconductor Equipment & Materials", "employees": 43461, "website": "https://www.asml.com", "city": "Veldhoven", "country": "Netherlands", "currency": "EUR", "marketCap": 453045944320, "trailingPE": 48.072483, "forwardPE": 43.360687, "trailingEps": 24.28, "dividendYield": 0.55, "dividendRate": 6.4, "priceToBook": 23.800493, "profitMargins": 0.29378, "beta": 1.341, "fiftyTwoWeekHigh": 1183.8, "fiftyTwoWeekLow": 508.4, "averageVolume": 587470, "totalRevenue": 32212000768, "grossProfits": 16979300352, "totalCash": 5128200192, "totalDebt": 2704699904, "ebitda": 12157899776, "lastUpdated": "2026-01-18T09:15:01.170583Z"}