{"symbol": "BAS.DE", "name": "BASF SE", "description": "BASF SE operates as a chemical company worldwide. It operates through six segments: Chemicals, Materials, Industrial Solutions, Surface Technologies, Nutrition & Care, and Agricultural Solutions. The Chemicals segment provides petrochemicals and intermediates. The Materials segment offers advanced materials and their precursors for applications and systems comprising isocyanates, polyamides, and inorganic basic products, as well as specialties for plastics and plastics processing industries. The Industrial Solutions segment develops and markets ingredients and additives for industrial applications, such as polymer dispersions, resins, additives, electronic materials, and antioxidants for automotive, plastics and adhesives, paints and coatings, construction, electronics, paper coatings, and energy and resources industries. The Surface Technologies segment provides catalysts, battery materials, automotive OEM and refinish coatings, surface treatment, and precious and base metal services for the automotive and chemical industries. The Nutrition & Care segment offers ingredients for consumer applications in the areas of nutrition, home, and personal care applications; and serves the food and feed producers, pharmaceutical, cosmetics, detergents, and cleaner industries, as well as fast-moving consumer goods sector. The Agricultural Solutions segment provides seeds and traits, and seed treatment products; fungicides, herbicides, insecticides, and biological crop protection products; and digital solutions. The company engages in engineering and other; rental and leasing; and commodity trading activities. BASF SE was founded in 1865 and is headquartered in Ludwigshafen am Rhein, Germany.", "sector": "Basic Materials", "industry": "Chemicals", "employees": 110709, "website": "https://www.basf.com", "city": "Ludwigshafen am Rhein", "country": "Germany", "currency": "EUR", "price": 44.59000015258789, "change": -1.7000007629394531, "changePercent": -3.6725010354648995, "dayLow": 44.59000015258789, "dayHigh": 46.13999938964844, "volume": 4195904, "open": 46.13999938964844, "previousClose": 46.290000915527344, "marketCap": 39797563392, "trailingPE": 131.14706, "forwardPE": 17.148285, "trailingEps": 0.34, "dividendYield": 5.05, "dividendRate": 2.25, "priceToBook": 1.2147877, "profitMargins": 0.00425, "beta": 0.908, "fiftyTwoWeekHigh": 55.06, "fiftyTwoWeekLow": 37.4, "averageVolume": 2104259, "totalRevenue": 64304001024, "grossProfits": 16451000320, "totalCash": 1892000000, "totalDebt": 24625999872, "ebitda": 6125000192, "lastUpdated": "2026-01-18T14:10:23.139672Z"}