{"symbol": "BHARTIARTL.NS", "name": "Bharti Airtel Limited", "description": "Bharti Airtel Limited operates as a telecommunications company in India and internationally. It operates through the Mobile Services India, Mobile Services Africa, Mobile Services South Asia, Airtel Business, Passive Tower Infrastructure Services, Homes Services, Digital TV Services, and Others segments. The company provides voice and data telecom services through wireless technology including 2G/3G/4G/5G services; passive infrastructure service, including the setup, operation, and maintenance of wireless communication towers; home services covering voice and data communications through fixed-line network, wireless network, and broadband technology for homes; and digital TV services comprising digital broadcasting services under the DTH platform and IPTV services. It also engages in the airtel business that includes network integration, managed services, CPaaS, PaaS, cloud, cybersecurity, IoT, and data center services, as well as enterprise mobility applications. In addition, the company offers post-paid, prepaid, roaming, internet, and various value-added services, as well as mobile TV, video calls, live-streaming videos, gaming, video streaming, and other services. The company was formerly known as Bharti Tele-Ventures Limited and changed its name to Bharti Airtel Limited in April 2006. Bharti Airtel Limited was incorporated in 1995 and is headquartered in New Delhi, India.", "sector": "Communication Services", "industry": "Telecom Services", "employees": 28701, "website": "https://www.airtel.in", "city": "New Delhi", "country": "India", "currency": "INR", "marketCap": 12282053525504, "trailingPE": 31.349503, "forwardPE": 29.541912, "trailingEps": 64.32, "dividendYield": 0.79, "dividendRate": 16.0, "priceToBook": 9.919665, "profitMargins": 0.19805, "beta": 0.061, "fiftyTwoWeekHigh": 2174.5, "fiftyTwoWeekLow": 1559.5, "averageVolume": 7374999, "totalRevenue": 1946135035904, "grossProfits": 1294111997952, "totalCash": 237588004864, "totalDebt": 2080097042432, "ebitda": 996800987136, "lastUpdated": "2026-01-18T09:12:45.047080Z"}