{"symbol": "CBQK.QA", "name": "The Commercial Bank (P.S.Q.C.)", "description": "The Commercial Bank (P.S.Q.C.), together with its subsidiaries, engages in the conventional banking, brokerage, and credit card businesses in Qatar and internationally. It operates through four segments: Wholesale Banking, Retail Banking, International, and Unallocated, Intra \u0096 group transaction and others segments. The Wholesale Banking segment provides various conventional funded and non-funded credit facilities; demand and time deposit services; currency exchange facilities; interest rate swaps and other derivative trading services; and loan syndication and structured financing services, as well as manages money market funds and proprietary investment portfolio. This segment serves corporate, commercial, and multinational customers. The Retail Banking segment offers personal current, savings, time, and investment account services; credit and debit card services; consumer and vehicle loans; residential mortgage services; custodial services to retail and individual customers; and brokerage services. The International segment provides banking services through a network of branches in Turkey. The Unallocated, Intra - group transactions segment undertakes Unallocated assets, liabilities and revenues related to central functions and non-core business operations. The company provides insurance products; letters of credit, letters of guarantee, and documentary and commercial letters of credit; foreign exchange and money market placement services; fund transfer services; Internet, mobile, and telephone banking services; and wealth management services. The Commercial Bank (P.S.Q.C.) was incorporated in 1974 and is based in Doha, Qatar.", "sector": "Financial Services", "industry": "Banks - Regional", "employees": null, "website": "https://www.cbq.qa", "city": "Doha", "country": "Qatar", "currency": "QAR", "marketCap": 18091223040, "trailingPE": 7.9821424, "forwardPE": 6.984375, "trailingEps": 0.56, "dividendYield": 6.8, "dividendRate": 0.3, "priceToBook": 0.6742081, "profitMargins": 0.62465, "beta": 0.379, "fiftyTwoWeekHigh": 5.049, "fiftyTwoWeekLow": 3.85, "averageVolume": 2480854, "totalRevenue": 3964433920, "grossProfits": 3964433920, "totalCash": 18872164352, "totalDebt": 64808529920, "ebitda": null, "lastUpdated": "2026-01-18T13:33:00.800194Z"}