{"symbol": "CEMEXCPO.MX", "name": "CEMEX, S.A.B. de C.V.", "description": "CEMEX, S.A.B. de C.V., together with its subsidiaries, engages in the production, marketing, distribution, and sale of cement, ready-mix concrete, aggregates, urbanization solutions, and other construction materials and services worldwide. The company offers gray ordinary portland, white portland, oil-well, and blended cement products; masonry or mortar products; standard ready-mix, architectural and decorative, rapid-setting, fiber-reinforced, fluid-fill, roller-compacted, self-consolidating, pervious, and antibacterial, and other concrete products; aggregate products, including crushed stone and manufactured sand, gravel, sand, and recycled concrete; and vertua products. It also provides including logistics and transportation, retail, pavement services, design and engineering, and other services; municipal and industrial waste management solutions; industrial construction products, such as precast components, 2D panels, 3D modules, and complete structures; and recycling and reusing construction, demolition, and excavation waste; and alternative raw material solutions. CEMEX, S.A.B. de C.V. was founded in 1906 and is headquartered in San Pedro Garza García, Mexico.", "sector": "Basic Materials", "industry": "Building Materials", "employees": 40244, "website": "https://www.cemex.com", "city": "San Pedro Garza García", "country": "Mexico", "currency": "MXN", "price": 22.030000686645508, "change": 0.220001220703125, "changePercent": 1.008717221871876, "dayLow": 21.760000228881836, "dayHigh": 22.100000381469727, "volume": 32553180, "open": 21.899999618530273, "previousClose": 21.809999465942383, "marketCap": 327645265920, "trailingPE": 13.79375, "forwardPE": 22.07, "trailingEps": 1.6, "dividendYield": 0.77, "dividendRate": 0.17, "priceToBook": 1.3309926, "profitMargins": 0.08596, "beta": 1.106, "fiftyTwoWeekHigh": 22.6, "fiftyTwoWeekLow": 10.17, "averageVolume": 26008335, "totalRevenue": 15869840384, "grossProfits": 5083612160, "totalCash": 1197716992, "totalDebt": 6789309952, "ebitda": 2364217088, "lastUpdated": "2026-01-18T14:12:35.422673Z"}