{"symbol": "CNR.TO", "name": "Canadian National Railway Company", "description": "Canadian National Railway Company, together with its subsidiaries, engages in the rail, intermodal, trucking, and related transportation businesses in Canada and the United States. The company provides rail services, which include equipment, custom brokerage services, transloading and distribution, business development and real estate, and private car storage services; and intermodal services, such as temperature controlled cargo, port partnerships, transloading and distribution, logistics parks, customs brokerage, and trucking. It offers door-to-door services, import and export dray, and interline services, as well as specialized services, comprising flatbed trucks, on-deck mobile transport trays, expedited cargo, and permit/overweight services; and supply chain services. The company serves automotive, coal, fertilizers, temperature controlled cargo, forest products, dimensional, grain, metal and minerals, petroleum and chemicals, consumer goods, and third party logistics applications. It track, maintenance, and strategic infrastructure initiatives for the safe movement of goods and support long-term sustainable growth in Minnesota and across CN's network. The company was incorporated in 1919 and is headquartered in Montreal, Canada.", "sector": "Industrials", "industry": "Railroads", "employees": 24237, "website": "https://www.cn.ca", "city": "Montreal", "country": "Canada", "currency": "CAD", "price": 139.27999877929688, "change": 1.3000030517578125, "changePercent": 0.9421677721492698, "dayLow": 136.8699951171875, "dayHigh": 139.30999755859375, "volume": 1274000, "open": 137.77000427246094, "previousClose": 137.97999572753906, "marketCap": 86938574848, "trailingPE": 18.94966, "forwardPE": 17.198439, "trailingEps": 7.35, "dividendYield": 2.55, "dividendRate": 3.55, "priceToBook": 4.0442524, "profitMargins": 0.26852, "beta": 0.895, "fiftyTwoWeekHigh": 154.56, "fiftyTwoWeekLow": 126.11, "averageVolume": 1422348, "totalRevenue": 17198000128, "grossProfits": 9639999488, "totalCash": 226000000, "totalDebt": 21621999616, "ebitda": 8942000128, "lastUpdated": "2026-01-18T14:10:59.134612Z"}