{"symbol": "DIB.AE", "name": "Dubai Islamic Bank P.J.S.C.", "description": "Dubai Islamic Bank P.J.S.C., together with its subsidiaries, engages in the corporate, retail, and investment banking activities in the United Arab Emirates and internationally. The company operates through five segments: Consumer Banking, Corporate Banking, Treasury, Real Estate Development, and Others. The Consumer Banking segment accepts deposits; and offers consumer murabahas, salam, home finance, ijarah, credit cards, and fund transfer facilities, as well as banking and wealth management services. The Corporate Banking segment provides current accounts, deposits, cash management, and risk management products, as well as financing and other credit facilities to corporate and institutional customers. The Treasury segment offers treasury services. The Real Estate Development segment is involved in the property development and other real estate investment activities. The Other segment provides investment banking services. It also offers brokerage, Islamic finance advisory, and labour services; property management services; printing and investment services; and vehicle trading services, as well as online banking services. Dubai Islamic Bank P.J.S.C. was incorporated in 1975 and is headquartered in Dubai, the United Arab Emirates.", "sector": "Financial Services", "industry": "Banks - Regional", "employees": null, "website": "https://www.dib.ae", "city": "Dubai", "country": "United Arab Emirates", "currency": "AED", "price": 9.489999771118164, "change": 0.010000228881835938, "changePercent": 0.10548765152658317, "dayLow": 9.420000076293945, "dayHigh": 9.529999732971191, "volume": 2714960, "open": 9.420000076293945, "previousClose": 9.479999542236328, "marketCap": 68585279488, "trailingPE": 8.869158, "forwardPE": 9.725951, "trailingEps": 1.07, "dividendYield": 4.74, "dividendRate": 0.45, "priceToBook": 1.6582211, "profitMargins": 0.61131, "beta": 0.051, "fiftyTwoWeekHigh": 10.05, "fiftyTwoWeekLow": 6.55, "averageVolume": 4023820, "totalRevenue": 13242118144, "grossProfits": 12977101824, "totalCash": 12893868032, "totalDebt": 22739564544, "ebitda": null, "lastUpdated": "2026-01-18T14:13:04.127119Z"}