{"symbol": "GMEXICOB.MX", "name": "Grupo México, S.A.B. de C.V.", "description": "Grupo México, S.A.B. de C.V. engages in copper production, cargo transportation, and infrastructure businesses worldwide. It operates through Mining, Transportation, and Infrastructure divisions. The Mining division explores for copper, silver, molybdenum, zinc, sulfuric acid, gold, cadmium, selenium, and lime. It owns interests in 15 underground and open pit mines, and 14 exploration projects in Mexico, Peru, the United States, Argentina, Chile, Ecuador, and Spain. The Transportation division offers railroad transportation services, including general and intermodal freight services by railroad; passenger transportation services; and auxiliary terminal management and intra-terminal hauling services. This division provides railroad services for the agriculture, automotive, cement, energy, intermodal, metals and minerals, industrial products, and chemical and fertilizer sectors. It operates a railroad network. The Infrastructure division offers land and ocean drilling services; and engineering services. It also generates energy through a combined cycle plant and wind farm; and constructs, operates, and maintains Salamanca-León highway and Silao Bypas. Grupo México, S.A.B. de C.V. was founded in 1890 and is based in Mexico City, Mexico.", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "employees": 31403, "website": "https://www.gmexico.com", "city": "Mexico City", "country": "Mexico", "currency": "MXN", "marketCap": 1510445678592, "trailingPE": 19.960905, "forwardPE": 17.052597, "trailingEps": 9.72, "dividendYield": 3.09, "dividendRate": 6.0, "priceToBook": 3.7653046, "profitMargins": 0.25801, "beta": 1.161, "fiftyTwoWeekHigh": 199.48, "fiftyTwoWeekLow": 91.08, "averageVolume": 5652252, "totalRevenue": 16870968320, "grossProfits": 9325008896, "totalCash": 8391488000, "totalDebt": 10182520832, "ebitda": 8641267712, "lastUpdated": "2026-01-18T13:31:47.400349Z"}