{"symbol": "GSK.L", "name": "GSK plc", "description": "GSK plc, together with its subsidiaries, engages in the research, development, and manufacture of vaccines, specialty medicines, and general medicines to prevent and treat disease in the United Kingdom, the United States, and internationally. It operates through Commercial Operations and Total R&D segments. The company offers specialty medicines that include oncology, respiratory/immunology, inflammation, and inhaled medicines for HIV, respiratory eosinophildriven diseases, lupus and lupus nephritis, ovarian cancer, and endometrial cancer. It also provides vaccines for Shingles, Meningitis, RSV, Seasonal Influenza, Hepatitis, Diphtheria, Tetanus, Acellular Pertussis, Rotavirus, Pertussis, Polio, Haemophilus, Invasive Diseases, Pneumonia, Acute Otitis Media, Measles, Mumps, Rubella and Chickenpox, and Human Papilloma Virus. Additionally, the company offers general medicines for asthma, COPD, bacterial infection, benign prostatic hyperplasia, allergic rhinitis, and inflammatory skin conditions. It has a collaboration agreement with CureVac to develop mRNA vaccines for infectious diseases. The company has a strategic alliance with AN2 Therapeutics, Inc. for the development of new therapies for TB. The company was formerly known as GlaxoSmithKline plc and changed its name to GSK plc in May 2022. GSK plc was founded in 1715 and is headquartered in London, United Kingdom.", "sector": "Healthcare", "industry": "Drug Manufacturers - General", "employees": 68629, "website": "https://www.gsk.com", "city": "London", "country": "United Kingdom", "currency": "GBp", "marketCap": 73279889408, "trailingPE": 13.657895, "forwardPE": 9.965602, "trailingEps": 1.33, "dividendYield": 3.52, "dividendRate": 0.64, "priceToBook": 452.87958, "profitMargins": 0.1708, "beta": 0.246, "fiftyTwoWeekHigh": 2057.7, "fiftyTwoWeekLow": 1242.5, "averageVolume": 8382311, "totalRevenue": 32166000640, "grossProfits": 23299000320, "totalCash": 3305999872, "totalDebt": 17749999616, "ebitda": 9518999552, "lastUpdated": "2026-01-18T09:13:01.994119Z"}