{"symbol": "INFY.NS", "name": "Infosys Limited", "description": "Infosys Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and digital services in North America, Europe, India, Switzerland, and internationally. It provides digital marketing and digital workplace, digital commerce, digital experience and interactions, and metaverse; data analytics and AI, applied AI, generative AI, and sustainability; blockchain, engineering, and Internet of Things; enterprise agile DevOps, API economy and microservices, application modernization, cloud, digital process automation, digital supply chain, Microsoft business application and cloud business, service experience transformation, energy transition, Network Transformation Services, Infrastructure Services cyber security, and quality engineering solutions; Oracle, SAP, and Saleforce solutions; Topaz, an AI-first set of services, solutions, and platforms using generative AI technologies; and Aster, a set of AI-amplified marketing services, solutions, and platforms. The company also offers Finacle, a core banking solution; Edge suite of products; Panaya platform, Infosys Equinox, Infosys Live Enterprise Suite, Infosys Wingspan, Infosys Helix, Infosys Meridian, Infosys Polycloud, Infosys Cortex, and Stater digital platforms; and Infosys McCamish, an insurance platform. It serves aerospace and defense, agriculture, automotive, chemical manufacturing, communication, consumer packaged goods, education, engineering procurement and construction, financial, healthcare, high technology, industrial manufacturing, information services and publishing, insurance, life science, logistics and distribution, media, entertainment, mining, oil and gas, private equity, professional, public, retail, semiconductor, travel, hospitality, utilities, and waste management industries. The company has a strategic collaboration with Anthropic PBC for the development of enterprise AI solutions to companies across telecommunications, financial services, manufacturing, and  software development. The company was formerly known as Infosys Technologies Limited and changed its name to Infosys Limited in June 2011. Infosys Limited was incorporated in 1981 and is headquartered in Bengaluru, India.", "sector": "Technology", "industry": "Information Technology Services", "employees": 337034, "website": "https://www.infosys.com", "city": "Bengaluru", "country": "India", "currency": "INR", "exchange": "NSI", "price": 1353.199951171875, "change": -17.300048828125, "changePercent": -1.2623165872400584, "dayLow": 1338.199951171875, "dayHigh": 1365.0, "volume": 12633552, "open": 1359.199951171875, "previousClose": 1370.5, "marketCap": 5474627878912, "trailingPE": 19.41742, "forwardPE": 17.761023, "peRatio": 19.41742, "trailingEps": 69.69, "eps": 69.69, "dividendYield": 3.33, "trailingAnnualDividendYield": 0.0003765049, "dividendRate": 45.0, "trailingAnnualDividendRate": 0.516, "payoutRatio": 0.6717, "lastDividendValue": 23.0, "lastDividendDate": 1761523200, "priceToBook": 6.53592, "profitMargins": 0.16153999, "beta": 0.26, "fiftyTwoWeekHigh": 1808.0, "fiftyTwoWeekLow": 1281.5, "fiftyTwoWeekChange": -0.23292333, "averageVolume": 9686984, "fiftyDayAverage": 1587.018, "twoHundredDayAverage": 1544.9604, "sharesOutstanding": 4045690377, "floatShares": 3443928505, "sharesShort": null, "shortRatio": null, "heldPercentInstitutions": 0.48589, "heldPercentInsiders": 0.16073999, "totalRevenue": 19847000064, "revenuePerShare": 4.798, "revenueGrowth": 0.032, "grossProfits": 5825999872, "grossMargins": 0.29354998, "operatingMargins": 0.18023, "ebitda": 4380499968, "ebitdaMargins": 0.22071, "netIncomeToCommon": 3206000128, "earningsGrowth": -0.053, "returnOnEquity": 0.32683, "returnOnAssets": 0.15672, "operatingCashflow": 4078000128, "freeCashflow": 3137812480, "totalCash": 2984999936, "totalCashPerShare": 0.738, "totalDebt": 978000000, "debtToEquity": 10.531, "currentRatio": 1.812, "quickRatio": 1.564, "bookValue": 207.04047, "enterpriseValue": 5472665993216, "enterpriseToEbitda": 1249.324, "priceToSalesTrailing12Months": 275.84158, "recommendationMean": 1.77778, "recommendationKey": "buy", "numberOfAnalystOpinions": 44, "targetLowPrice": 1414.0, "targetMeanPrice": 1781.8864, "targetMedianPrice": 1810.0, "targetHighPrice": 2076.0, "recommendationTrend": null, "lastUpdated": "2026-02-22T01:58:43.448594+00:00Z"}