{"symbol": "INTC", "name": "Intel Corporation", "description": "Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Intel Products, Intel Foundry, and All Other segments. The company offers microprocessor and chipset, stand-alone SoC, and multichip package; Computer Systems and Devices; hardware products comprising CPUs, graphics processing units (GPUs), accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company provides driving assistance and self-driving solutions; advanced process technologies enabled by an ecosystem of electronic design automation tools, intellectual property, and design services, as well as systems of chips, including advanced packaging technologies, software, and system. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.", "sector": "Technology", "industry": "Semiconductors", "employees": 88400, "website": "https://www.intel.com", "city": "Santa Clara", "country": "United States", "currency": "USD", "marketCap": 223999197184, "trailingPE": 782.6667, "forwardPE": 78.22885, "trailingEps": 0.06, "dividendYield": null, "dividendRate": null, "priceToBook": 2.1039426, "profitMargins": 0.0037099998, "beta": 1.354, "fiftyTwoWeekHigh": 50.39, "fiftyTwoWeekLow": 17.67, "averageVolume": 92116061, "totalRevenue": 53439000576, "grossProfits": 17646999552, "totalCash": 30934999040, "totalDebt": 46553001984, "ebitda": 10437000192, "lastUpdated": "2026-01-18T09:12:35.552196Z"}