{"symbol": "KO", "name": "The Coca-Cola Company", "description": "The Coca-Cola Company, a beverage company, manufactures and sells various nonalcoholic beverages in the United States and internationally. The company provides sparkling soft drinks and flavors; water, sports, coffee, and tea; juice, value-added dairy, and plant-based beverages; and other beverages. It also offers beverage concentrates and syrups, as well as fountain syrups to fountain retailers comprising restaurants and convenience stores. The company sells its products under the Coca-Cola, Diet Coke/Coca-Cola Light, Coca-Cola Zero Sugar, caffeine free Diet Coke, Cherry Coke, Fanta Orange, Fanta Zero Orange, Fanta Zero Sugar, Fanta Apple, Sprite, Sprite Zero Sugar, Simply Orange, Simply Apple, Simply Grapefruit, Fresca, Schweppes, Thums Up, Aquarius, Ayataka, BODYARMOR, Ciel, Costa, Crystal, Dasani, dogadan, Fuze Tea, Georgia, glacéau smartwater, glacéau vitaminwater, Gold Peak, I LOHAS, Powerade, Topo Chico, Core Power, Del Valle, fairlife, innocent, Maaza, Minute Maid, Minute Maid Pulpy, and Simply brands. It operates through a network of independent bottling partners, distributors, wholesalers, and retailers, as well as through bottling and distribution operators. The company was founded in 1886 and is headquartered in Atlanta, Georgia.", "sector": "Consumer Defensive", "industry": "Beverages - Non-Alcoholic", "employees": 69700, "website": "https://www.coca-colacompany.com", "city": "Atlanta", "country": "United States", "currency": "USD", "marketCap": 303150333952, "trailingPE": 23.324505, "forwardPE": 21.8787, "trailingEps": 3.02, "dividendYield": 2.9, "dividendRate": 2.04, "priceToBook": 9.698472, "profitMargins": 0.2734, "beta": 0.387, "fiftyTwoWeekHigh": 74.38, "fiftyTwoWeekLow": 61.37, "averageVolume": 16787250, "totalRevenue": 47663001600, "grossProfits": 29376000000, "totalCash": 15781000192, "totalDebt": 48161001472, "ebitda": 16307000320, "lastUpdated": "2026-01-18T13:27:53.235525Z"}