{"symbol": "LONN.SW", "name": "Lonza Group AG", "description": "Lonza Group AG, together with its subsidiaries, supplies various products and services for pharmaceutical, biotech, and nutrition markets in Europe, North and Central America, Latin America, Asia, Australia, New Zealand, and internationally. It operates through Biologics; Small Molecules; Cell & Gene; and Capsules & Health Ingredients segments. The Biologics segment engages in the contract development and manufacturing of biopharmaceuticals for clinical and commercial manufacturing needs throughout the product lifecycle, including drug substance and drug product manufacturing. Its Small Molecules segment provides integrated development and manufacturing services for small molecule drug substances and their intermediates. This segment also supports customers across aspects of design, development, and manufacturing, such as particle engineering and drug product packaging. The Cell & Gene segment develops technologies and platforms that industrialize the manufacturing processes and production of cell and gene therapies; offers contract development and manufacturing services, and regulatory support for a range of allogeneic and autologous cell therapies, and exosome-based therapies, as well as viral vector gene therapies. This segment also provides Cocoon platform, a closed automated system for patient-scale cell therapy manufacturing; and specialty raw materials and enabling technology solutions in cell and gene therapy, injectable drugs, vaccines, and bio-manufacturing markets. Its Capsules & Health Ingredients segment offers capsules, dosage form solutions, and health ingredients for pharmaceutical and nutraceutical customers. Lonza Group AG was incorporated in 1897 and is headquartered in Basel, Switzerland.", "sector": "Healthcare", "industry": "Diagnostics & Research", "employees": 19299, "website": "https://www.lonza.com", "city": "Basel", "country": "Switzerland", "currency": "CHF", "price": 559.2000122070312, "change": -5.0, "changePercent": -0.886210544455867, "dayLow": 557.5999755859375, "dayHigh": 568.7999877929688, "volume": 139240, "open": 568.7999877929688, "previousClose": 564.2000122070312, "marketCap": 39225393152, "trailingPE": 53.769234, "forwardPE": 28.361227, "trailingEps": 10.4, "dividendYield": 0.72, "dividendRate": 4.0, "priceToBook": 4.54479, "profitMargins": 0.10334, "beta": 0.959, "fiftyTwoWeekHigh": 616.0, "fiftyTwoWeekLow": 467.8, "averageVolume": 135643, "totalRevenue": 7093000192, "grossProfits": 2587000064, "totalCash": 907000000, "totalDebt": 4614000128, "ebitda": 1944999936, "lastUpdated": "2026-01-18T14:11:36.387987Z"}