{"symbol": "MA", "name": "Mastercard Incorporated", "description": "Mastercard Incorporated, a technology company, provides transaction processing and other payment-related products and services in the United States and internationally. The company offers integrated products and value-added services for account holders, merchants, financial institutions, digital partners, businesses, governments, and other organizations, such as programs that enable issuers to provide consumers with credits to defer payments; payment products and solutions that allow its customers to access funds in deposit and other accounts; prepaid programs services; consumer bill payment services; and commercial credit, debit, and prepaid payment products and solutions. It also provides solutions that enable businesses or governments to make payments to businesses, including Virtual Card Number, which is generated dynamically from a physical card and leverages the credit limit of the funding account; and a platform to optimize supplier payment enablement campaigns for financial institutions. In addition, the company offers Mastercard Move, which partners with digital messaging and payment platforms to enable consumers to send money directly within applications to other consumers; and partners with central banks, fintechs and financial institutions to help governments and nonprofits, as well as enables various cross-border payment flows. Further, it provides security solutions; personalization, issuer and merchant loyalty, and marketing services; advanced analytics, business intelligence, economic and location-based insights, payments consulting, and operational insights services; processing and gateway solutions; and open banking services. The company offers payment solutions and services under the MasterCard, Maestro, and Cirrus names. Mastercard Incorporated was founded in 1966 and is headquartered in Purchase, New York.", "sector": "Financial Services", "industry": "Credit Services", "employees": 35300, "website": "https://www.mastercard.com", "city": "Purchase", "country": "United States", "currency": "USD", "marketCap": 487705346048, "trailingPE": 34.472206, "forwardPE": 28.22501, "trailingEps": 15.65, "dividendYield": 0.65, "dividendRate": 3.48, "priceToBook": 61.43833, "profitMargins": 0.45275003, "beta": 0.857, "fiftyTwoWeekHigh": 601.77, "fiftyTwoWeekLow": 465.59, "averageVolume": 2908808, "totalRevenue": 31473999872, "grossProfits": 31473999872, "totalCash": 10648000512, "totalDebt": 18983000064, "ebitda": 19612000256, "lastUpdated": "2026-01-18T09:12:33.804576Z"}