{"symbol": "MB.MI", "name": "Mediobanca Banca di Credito Finanziario S.p.A.", "description": "Mediobanca Banca di Credito Finanziario S.p.A., together with its subsidiaries, provides various banking products and services in Italy, Other European countries, the United States, Asia, and internationally. It operates through Wealth Management, Consumer Finance, Corporate and Investment Banking, Insurance - Principal Investing, and Holding Functions segments. The Wealth Management segment offers asset management and management services to private banking and premier customers. Its Consumer Finance segment provides a range of consumer credit products comprising personal and special-purpose loans, salary-or pension-backed finances, and credit cards, as well as Pagolight, a buy-now-pay-later solution. The Corporate and Investment Banking segment offers lending, capital market, advisory, and trading services; and specialty finance services, such as factoring and credit management services. Its Insurance - Principal Investing segment engages in the equity investment and holding activities. The Holding Functions segment engages in treasury, and asset and liability management operations. Mediobanca Banca di Credito Finanziario S.p.A. was founded in 1946 and is headquartered in Milan, Italy. Mediobanca Banca di Credito Finanziario S.p.A. is a subsidiary of Banca Monte dei Paschi di Siena S.p.A.", "sector": "Financial Services", "industry": "Banks - Regional", "employees": 5551, "website": "https://www.mediobanca.com", "city": "Milan", "country": "Italy", "currency": "EUR", "price": 17.170000076293945, "change": -0.6200008392333984, "changePercent": -3.4851085290965536, "dayLow": 17.170000076293945, "dayHigh": 17.790000915527344, "volume": 3155120, "open": 17.780000686645508, "previousClose": 17.790000915527344, "marketCap": 13845888000, "trailingPE": 10.533742, "forwardPE": 9.155722, "trailingEps": 1.63, "dividendYield": 6.7, "dividendRate": 1.15, "priceToBook": 1.2286226, "profitMargins": 0.38901, "beta": 0.644, "fiftyTwoWeekHigh": 22.34, "fiftyTwoWeekLow": 13.19, "averageVolume": 1398314, "totalRevenue": 3319502080, "grossProfits": 3319502080, "totalCash": 16908600320, "totalDebt": 40219598848, "ebitda": null, "lastUpdated": "2026-01-18T14:12:11.187796Z"}