{"symbol": "MSFT", "name": "Microsoft Corporation", "description": "Microsoft Corporation develops and supports software, services, devices, and solutions worldwide. The company's Productivity and Business Processes segment offers Microsoft 365 Commercial, Enterprise Mobility + Security, Windows Commercial, Power BI, Exchange, SharePoint, Microsoft Teams, Security and Compliance, and Copilot; Microsoft 365 Commercial products, such as Windows Commercial on-premises and Office licensed services; Microsoft 365 Consumer products and cloud services, such as Microsoft 365 Consumer subscriptions, Office licensed on-premises, and other consumer services; LinkedIn; Dynamics products and cloud services, such as Dynamics 365, cloud-based applications, and on-premises ERP and CRM applications. Its Intelligent Cloud segment provides Server products and cloud services, such as Azure and other cloud services, GitHub, Nuance Healthcare, virtual desktop offerings, and other cloud services; Server products, including SQL and Windows Server, Visual Studio and System Center related Client Access Licenses, and other on-premises offerings; Enterprise and partner services, including Enterprise Support and Nuance professional Services, Industry Solutions, Microsoft Partner Network, and Learning Experience. The company's Personal Computing segment provides Windows and Devices, such as Windows OEM licensing and Devices and Surface and PC accessories; Gaming services and solutions, such as Xbox hardware, content, and services, first- and third-party content Xbox Game Pass, subscriptions, and Cloud Gaming, advertising, and other cloud services; search and news advertising services, such as Bing and Copilot, Microsoft News and Edge, and third-party affiliates. It sells its products through OEMs, distributors, and resellers; and online and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.", "sector": "Technology", "industry": "Software - Infrastructure", "employees": 228000, "website": "https://www.microsoft.com", "city": "Redmond", "country": "United States", "currency": "USD", "price": 459.8599853515625, "change": 3.199981689453125, "changePercent": 0.7007361415038325, "dayLow": 456.4800109863281, "dayHigh": 463.19000244140625, "volume": 33795700, "open": 457.8299865722656, "previousClose": 456.6600036621094, "marketCap": 3418215677952, "trailingPE": 32.683723, "forwardPE": 24.528952, "trailingEps": 14.07, "dividendYield": 0.79, "dividendRate": 3.64, "priceToBook": 9.415643, "profitMargins": 0.35707, "beta": 1.073, "fiftyTwoWeekHigh": 555.45, "fiftyTwoWeekLow": 344.79, "averageVolume": 23998909, "totalRevenue": 293812011008, "grossProfits": 202037002240, "totalCash": 102012002304, "totalDebt": 120375001088, "ebitda": 166436995072, "lastUpdated": "2026-01-18T14:09:29.030099Z"}