{"symbol": "NAB.AX", "name": "National Australia Bank Limited", "description": "National Australia Bank Limited provides financial services to individuals and businesses in Australia, New Zealand, Europe, Asia, the United States, and internationally. The company operates through Business and Private Banking; Personal Banking; Corporate and Institutional Banking; New Zealand Banking; and Corporate Functions and Other segments. It accepts transaction accounts, savings accounts, debit cards, and term deposits; and specialized accounts, such as foreign currency, business interest, cash maximiser, farm management, community free saver, statutory trust, and project bank accounts, as well as farm management deposits. In addition, the company provides home loans, personal loans, and business loans; vehicle and equipment finance; and trade and invoice finance, as well as business overdrafts and bank guarantees. Further, it offers insurance products consisting of home and content, landlord, travel, car, caravan and trailer, life, and business insurance products; and self-managed super funds, cash management, and financial advice services. Additionally, the company provides investment products; credit, debit, and business cards; payments and merchant services; online and internet banking services; small business services; international and foreign exchange solutions; and industry-specific banking services. The company was founded in 1834 and is based in Melbourne, Australia.", "sector": "Financial Services", "industry": "Banks - Diversified", "employees": 41880, "website": "https://www.nab.com.au", "city": "Melbourne", "country": "Australia", "currency": "AUD", "price": 42.66999816894531, "change": 0.30999755859375, "changePercent": 0.7318167000167501, "dayLow": 42.04999923706055, "dayHigh": 42.79999923706055, "volume": 3545682, "open": 42.11000061035156, "previousClose": 42.36000061035156, "marketCap": 130381094912, "trailingPE": 19.307692, "forwardPE": 17.648712, "trailingEps": 2.21, "dividendYield": 3.98, "dividendRate": 1.7, "priceToBook": 2.0720632, "profitMargins": 0.33729, "beta": 0.674, "fiftyTwoWeekHigh": 45.25, "fiftyTwoWeekLow": 31.13, "averageVolume": 3869209, "totalRevenue": 20039000064, "grossProfits": 20039000064, "totalCash": 169436004352, "totalDebt": 306633015296, "ebitda": null, "lastUpdated": "2026-01-18T14:11:10.595329Z"}