{"symbol": "NESN.SW", "name": "Nestlé S.A.", "description": "Nestlé S.A., together with its subsidiaries, operates as a food and beverage company. It operates through Zone North America; Zone Europe; Zone Asia, Oceania and Africa; Zone Latin America; Zone Greater China; Nestlé Health Science; and Nespresso segments. It offers water under the Acqua Panna, Nestlé Pure Life, Perrier, S.Pellegrino, Sanpellegrino, and other local brands; and chocolate and confectionery products under the Aero, Baci Perugina, KitKat, Milkybar, Smarties, and other local brands; family nutrition products, including early childhood, kids and teenagers, and maternal and adult products; cereals; dairy and drink products; food services, such as coffee, beverages, and food; healthcare nutrition products comprising lifestyle and medical nutrition products; plant-based products; and recipes. The company also provides coffee products under the Blue Bottle Coffee, Nescafé, Nescafé Dolce Gusto, Nespresso, and Starbucks Coffee At Home brands; culinary, chilled, and frozen food products under the DiGiorno, Garden Gourmet, Maggi, Thomy, and other local brands; ice cream products under the Antica Gelateria Del Corso, Drumstick, Extrême, Häagen-Dazs, Maxibon, and Mövenpick brands; and pet care products under the Cat Chow, Dentalife, Dog Chow, Fancy Feast, Felix, Friskies, Gourmet, Purina, Purina ONE, Purina Pro Plan, Purina Pro Plan Veterinary Diets, and other local brands. The company was founded in 1866 and is headquartered in Vevey, Switzerland.", "sector": "Consumer Defensive", "industry": "Packaged Foods", "employees": 251786, "website": "https://www.nestle.com", "city": "Vevey", "country": "Switzerland", "currency": "CHF", "price": 75.23999786376953, "change": -1.279998779296875, "changePercent": -1.6727637682311078, "dayLow": 75.23999786376953, "dayHigh": 76.22000122070312, "volume": 4940026, "open": 76.1500015258789, "previousClose": 76.5199966430664, "marketCap": 193571078144, "trailingPE": 18.81, "forwardPE": 16.76101, "trailingEps": 4.0, "dividendYield": 4.05, "dividendRate": 3.05, "priceToBook": 6.716058, "profitMargins": 0.11337, "beta": 0.511, "fiftyTwoWeekHigh": 91.72, "fiftyTwoWeekLow": 69.9, "averageVolume": 3525912, "totalRevenue": 90898997248, "grossProfits": 42410000384, "totalCash": 5514999808, "totalDebt": 65604001792, "ebitda": 17560999936, "lastUpdated": "2026-01-18T14:11:34.787327Z"}