{"symbol": "NKE", "name": "NIKE, Inc.", "description": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells athletic and casual footwear, apparel, equipment, accessories, and services for men, women, and kids in North America, Europe, the Middle East, Africa, Greater China, the Asia Pacific, and Latin America. The company offers its products under the NIKE, Jordan, Jumpman, Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also provides a line of performance equipment and accessories, including bags, socks, sport balls, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities, as well as various plastic products to other manufacturers; distributes and licenses casual sneakers, apparel, and accessories; and markets apparel with licensed college and professional team and league logos. In addition, the company offers consumer services and experiences, including sport focused events and activations; fitness and activity apps; sport, fitness, and wellness content; and digital services and features in retail stores. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other wholesale accounts through NIKE-owned retail stores, independent distributors, licensees, sales representatives, and digital platforms. The company was formerly known as Blue Ribbon Sports, Inc. and changed its name to NIKE, Inc. in May 1971. NIKE, Inc. was founded in 1964 and is headquartered in Beaverton, Oregon.", "sector": "Consumer Cyclical", "industry": "Footwear & Accessories", "employees": 77800, "website": "https://www.nike.com", "city": "Beaverton", "country": "United States", "currency": "USD", "marketCap": 95307079680, "trailingPE": 37.64912, "forwardPE": 27.674015, "trailingEps": 1.71, "dividendYield": 2.55, "dividendRate": 1.64, "priceToBook": 6.764026, "profitMargins": 0.05426, "beta": 1.284, "fiftyTwoWeekHigh": 82.44, "fiftyTwoWeekLow": 52.28, "averageVolume": 17788319, "totalRevenue": 46513000448, "grossProfits": 19132000256, "totalCash": 8344999936, "totalDebt": 11281999872, "ebitda": 3808000000, "lastUpdated": "2026-01-18T13:27:43.870350Z"}