{"symbol": "PETR4.SA", "name": "Petróleo Brasileiro S.A. - Petrobras", "description": "Petróleo Brasileiro S.A. - Petrobras explores, produces, and sells oil and gas in Brazil and internationally. It operates through three segments: Exploration and Production; Refining, Transportation & Marketing; and Gas & Low Carbon Energies. The Exploration and Production segment explores, develops, and produces crude oil, natural gas liquids, and natural gas primarily for supplies to the domestic refineries. The Refining, Transportation and Marketing segment engages in the refining, logistics, transport, acquisition, and export of crude oil; trading of oil products; and production of fertilizers, as well as holding interests in petrochemical companies. The Gas and Low Carbon Energies segment is involved in the logistic and trading of natural gas and electricity; transportation and trading of liquefied natural gas; generation of electricity through thermoelectric power plants; renewable energy business; low carbon business; and natural gas processing business, as well as production of biodiesel and its co-products. The company also engages in prospecting, drilling, refining, processing, trading, and transporting crude oil from producing onshore and offshore oil fields, and shale or other rocks, as well as oil products, natural gas, and other liquid hydrocarbons. In addition, it engages in the research, development, production, transportation, distribution, and trading of energy. The company was incorporated in 1953 and is headquartered in Rio de Janeiro, Brazil.", "sector": "Energy", "industry": "Oil & Gas Integrated", "employees": 41778, "website": "https://petrobras.com.br", "city": "Rio De Janeiro", "country": "Brazil", "currency": "BRL", "price": 32.040000915527344, "change": 0.25, "changePercent": 0.786410798364876, "dayLow": 31.8799991607666, "dayHigh": 32.20000076293945, "volume": 70947300, "open": 31.950000762939453, "previousClose": 31.790000915527344, "marketCap": 430539309056, "trailingPE": 5.533679, "forwardPE": 3.9850748, "trailingEps": 5.79, "dividendYield": 14.45, "dividendRate": 4.63, "priceToBook": 0.97641253, "profitMargins": 0.15774, "beta": -0.032, "fiftyTwoWeekHigh": 38.66, "fiftyTwoWeekLow": 0.0, "averageVolume": 37741981, "totalRevenue": 491446009856, "grossProfits": 236640993280, "totalCash": 62001000448, "totalDebt": 376082989056, "ebitda": 191036997632, "lastUpdated": "2026-01-18T14:12:23.731145Z"}