{"symbol": "PHIA.AS", "name": "Koninklijke Philips N.V.", "description": "Koninklijke Philips N.V. operates as a health technology company in North America, the Greater China, and internationally. The company operates through Diagnosis & Treatment, Connected Care, and Personal Health segments. It provides diagnostic imaging solutions, includes magnetic resonance imaging; X-ray systems; and computed tomography (CT) systems and software comprising detector-based spectral CT solutions; ultrasound imaging solutions focused on diagnosis, treatment planning and guidance for cardiac, general imaging, obstetrics/gynecology, and point-of-care applications; integrated interventional X-ray systems and software solutions; and interventional image devices and software to aid in the diagnosis, navigation, treatment, and confirmation in minimally invasive interventional coronary, peripheral vascular, and hearth rhythm management procedures. The company also offers acute patient management solutions; emergency care solutions; patient care management in ambulatory and home care; sleep and respiratory care solutions; and vendor-agnostic software solutions. In addition, it provides power toothbrushes, brush heads, and interdental cleaning and teeth whitening products; infant feeding, baby monitors, and digital parental and women's health solutions; and grooming and beauty products and solutions. The company was formerly known as Koninklijke Philips Electronics N.V. and changed its name to Koninklijke Philips N.V. in May 2013. Koninklijke Philips N.V. was founded in 1891 and is headquartered in Amsterdam, the Netherlands.", "sector": "Healthcare", "industry": "Medical Devices", "employees": 67035, "website": "https://www.philips.com", "city": "Amsterdam", "country": "Netherlands", "currency": "EUR", "marketCap": 24383100928, "trailingPE": 160.25, "forwardPE": 16.882637, "trailingEps": 0.16, "dividendYield": 3.32, "dividendRate": 0.85, "priceToBook": 2.3107426, "profitMargins": 0.00928, "beta": 0.903, "fiftyTwoWeekHigh": 27.63, "fiftyTwoWeekLow": 18.9, "averageVolume": 1395077, "totalRevenue": 17780000768, "grossProfits": 7733000192, "totalCash": 1912000000, "totalDebt": 8384999936, "ebitda": 1619000064, "lastUpdated": "2026-01-18T13:30:33.526273Z"}