{"symbol": "QIBK.QA", "name": "Qatar Islamic Bank (Q.P.S.C.)", "description": "Qatar Islamic Bank (Q.P.S.C.), together with its subsidiaries, provides corporate, retail, and investment banking products and services in Qatar and internationally. The company operates through four segments: Corporate Banking, Personal Banking, Group Function, and Local & International Subsidiaries. It offers current, savings/call, bedaya, misk, minor, domestic worker, checking, and time deposit accounts; term deposits; growing deposits; certificates of deposit; prepaid, credit, charge, co-branded, and debit cards; and digital wallets. The company also provides personal, car, home, instant, working capital, asset, mortgage and real estate, project, contracting, start-up business, trade, and fleet and heavy equipment finance, as well as finance for general corporate purposes; foreign exchange services; and import and export letters of credit. In addition, it offers accounts and cash management; trade finance services, such as letters of credit, letters of guarantee, documentary/bills collection, and shipping guarantees services; and treasury services, including liquidity management, Sukuk, foreign exchange, hedging services, and investment products. Further, the company provides education, auto, family shield, travel, group credit life, and saving Takaful programs; point of sale solutions and online payment gateways; insurance; remote deposit cheques; wages protection systems; payroll, cash and cheque collection, overnight vaulting, and wealth management services; Internet, phone, SMS, mobile, and automated teller machines and cash deposit machines banking services; and transfer services. The company serves individual customers, institutional investors, corporates, small and medium enterprises, financial institutions, and investment vehicles. Qatar Islamic Bank (Q.P.S.C.) was incorporated in 1982 and is headquartered in Doha, Qatar.", "sector": "Financial Services", "industry": "Banks - Regional", "employees": null, "website": "https://www.qib.com.qa", "city": "Doha", "country": "Qatar", "currency": "QAR", "price": 24.670000076293945, "change": 0.020000457763671875, "changePercent": 0.08113776094599541, "dayLow": 24.65999984741211, "dayHigh": 25.0, "volume": 416454, "open": 24.65999984741211, "previousClose": 24.649999618530273, "marketCap": 58293530624, "trailingPE": 12.716495, "forwardPE": 13.705556, "trailingEps": 1.94, "dividendYield": 3.85, "dividendRate": 0.95, "priceToBook": 1.7336613, "profitMargins": 0.43297002, "beta": null, "fiftyTwoWeekHigh": 25.97, "fiftyTwoWeekLow": 19.25, "averageVolume": 900124, "totalRevenue": 11166999552, "grossProfits": 11166999552, "totalCash": 8970999808, "totalDebt": 35081998336, "ebitda": null, "lastUpdated": "2026-01-18T14:13:20.543124Z"}