{"symbol": "QNBK.QA", "name": "Qatar National Bank (Q.P.S.C.)", "description": "Qatar National Bank (Q.P.S.C.), together with its subsidiaries, provides conventional and Islamic banking products and services in Qatar, Europe, North America, rest of GCC countries, and internationally. It operates through four segments: Corporate Banking, Consumer Banking, Asset and Wealth Management, and International Banking. The company offers personal banking products and services, such as current, savings, fixed deposit, and call-notice deposit accounts; personal, vehicle, vehicle lease, and mortgage loans, as well as other lending; life, salary continuation, critical illness, motor, mortgage, and travel insurance products; life insurance saving and investment products; asset management services; credit, debit, and prepaid cards; and payment, mobile, Internet, ATM, ITM, SMS, and USSD banking services. It also provides business banking products and services, including current, call, fixed deposit, SME, and non-resident accounts; working capital, syndicated, project, and vehicle loans; contractor, structured, trade, and project finance; short and medium-term advances, bank guarantees, contract guarantees, letters of credit, and treasury products; foreign trade, retail, foreign exchange and currency and cash management services; commercial and transaction banking services; and credit cards. In addition, the company offers investment and advisory, and brokerage and custody services. It serves individuals, corporate and institutional clients, governments, semi-government institutions, and various industrial sectors. The company was formerly known as Qatar National Bank S.A.Q. and changed its name to Qatar National Bank (Q.P.S.C.) in January 2016. The company was incorporated in 1964 and is based in Doha, Qatar.", "sector": "Financial Services", "industry": "Banks - Diversified", "employees": null, "website": "https://www.qnb.com", "city": "Doha", "country": "Qatar", "currency": "QAR", "marketCap": 180067844096, "trailingPE": 11.482558, "forwardPE": 11.03352, "trailingEps": 1.72, "dividendYield": 3.62, "dividendRate": 0.72, "priceToBook": 1.7459335, "profitMargins": 0.4892, "beta": 0.309, "fiftyTwoWeekHigh": 20.49, "fiftyTwoWeekLow": 14.82, "averageVolume": 2476005, "totalRevenue": 34750672896, "grossProfits": 34750672896, "totalCash": 98082570240, "totalDebt": 147747569664, "ebitda": null, "lastUpdated": "2026-01-18T13:33:01.469642Z"}