{"symbol": "REP.MC", "name": "Repsol, S.A.", "description": "Repsol, S.A. operates as a multi-e energy company in Spain, Peru, the United States, Portugal, and internationally. The company operates through Upstream, Industrial, Customer, and Low-Carbon Generation segments. Its Upstream segment engages in the exploration, development, and production of crude oil and natural gas reserves, as well as develops low-carbon geological solutions. The company's Industrial segment is involved in refining activities and petrochemicals business; the trading, transport, and sale of crude oil, natural gas, and fuels; and development of hydrogen, sustainable biofuels, and synthetic fuels. Its Customer segment involved in mobility; and sale of fuel products, electricity and gas, lubricants, and other specialties. The company's Low-Carbon Generation segment engages in the low-emissions electricity generation and renewable sources. It also provides asphalt products; installs, operates, and manages service stations; provides maritime services; constructs and operates oil refineries; explores and produces hydrocarbons; offers human resource; distributes and supplies electricity; and develops new energy projects, solar, and wind projects, as well as produces and sells chemical products and lubricants. In addition, the company involved in fuel and special products sale, research, trading and transport, insurance and reinsurance, safety, and financing activities; development of production processes, storage, transport, use, consumption, and transformation of hydrogen; decarbonization activities; and promotion, design, construction, and operation of molecular recycling facilities. Further, the company produces synthetic oil cloths; and invests in liquefaction plant project. The company was formerly known as Repsol YPF, S.A. and changed its name to Repsol, S.A. in May 2012. Repsol, S.A. was founded in 1927 and is headquartered in Madrid, Spain.", "sector": "Energy", "industry": "Oil & Gas Integrated", "employees": 25136, "website": "https://www.repsol.com", "city": "Madrid", "country": "Spain", "currency": "EUR", "marketCap": 17407440896, "trailingPE": 16.521053, "forwardPE": 6.328042, "trailingEps": 0.95, "dividendYield": 6.37, "dividendRate": 1.0, "priceToBook": 0.84819496, "profitMargins": 0.02333, "beta": 0.187, "fiftyTwoWeekHigh": 17.27, "fiftyTwoWeekLow": 9.414, "averageVolume": 4603793, "totalRevenue": 48905998336, "grossProfits": 12624000000, "totalCash": 7982000128, "totalDebt": 14817000448, "ebitda": 4695000064, "lastUpdated": "2026-01-18T13:30:53.143944Z"}