{"symbol": "SAN.PA", "name": "Sanofi", "description": "Sanofi engages in the research, development, manufacture, and marketing of therapeutic solutions. It provides immunology and inflammation, rare diseases, neurology, oncology, and other medicines and vaccines. It also offers poliomyelitis, pertussis, and haemophilus influenzae type b (Hib) pediatric vaccines; respiratory syncytial virus protection and hexavalent combination vaccines protecting against diphtheria, tetanus, pertussis, polio, Hib, and hepatitis B; influenza, booster, meningitis, and travel and endemic vaccines, that includes hepatitis A, typhoid, yellow fever, and rabies vaccines. It has a collaboration and license agreement with Exscientia to develop up to 15 novel small-molecule for oncology and immunology; ABL Bio, Inc. to develop ABL301, a treatment for alpha-synucleinopathies; Innate Pharma SA for a natural killer cell engager program targeting B7-H3; and Blackstone Life Sciences to develop pivotal studies and clinical development program. Further, it has a collaboration agreement with IGM Biosciences, Inc. to develop, manufacture, and commercialize IgM antibody; Kymera Therapeutics, Inc. to develop and commercialize protein degrader therapies targeting IRAK4 in patients with immune-inflammatory diseases; Nurix Therapeutics, Inc. to develop novel targeted protein degradation therapies; Denali Therapeutics Inc. to treat a range of systemic inflammatory diseases, such as ulcerative colitis; and Adagene Inc. for the discovery and development of antibody-based therapies. Additionally, it has a collaboration with Scribe Therapeutics Inc. to develop genome editing technologies; and co-promotion service agreement with Provention Bio, Inc. for the commercialization of teplizumab, as well as a strategic alliance with the Department of Health \u0096 Abu Dhabi for the development of global vaccines. The company was formerly known as Sanofi-Aventis and changed its name to Sanofi in May 2011. Sanofi was incorporated in 1994 and is headquartered in Paris, France.", "sector": "Healthcare", "industry": "Drug Manufacturers - General", "employees": 82878, "website": "https://www.sanofi.com", "city": "Paris", "country": "France", "currency": "EUR", "price": 80.77999877929688, "change": -0.8499984741210938, "changePercent": -1.0412820074981726, "dayLow": 80.44999694824219, "dayHigh": 81.54000091552734, "volume": 1859208, "open": 81.41999816894531, "previousClose": 81.62999725341797, "marketCap": 97856061440, "trailingPE": 15.416031, "forwardPE": 9.653038, "trailingEps": 5.24, "dividendYield": 4.85, "dividendRate": 3.92, "priceToBook": 1.3430876, "profitMargins": 0.19840999, "beta": 0.395, "fiftyTwoWeekHigh": 110.88, "fiftyTwoWeekLow": 76.15, "averageVolume": 1802631, "totalRevenue": 45930999808, "grossProfits": 33072001024, "totalCash": 8906000384, "totalDebt": 21755000832, "ebitda": 12334000128, "lastUpdated": "2026-01-18T14:10:31.843781Z"}