{"symbol": "SAN.MC", "name": "Banco Santander, S.A.", "description": "Banco Santander, S.A. provides various financial products and services to individuals, small and medium-sized enterprises, large corporations, and public entities worldwide. The company operates through five segments: Retail & Commercial Banking, Digital Consumer Bank, Corporate & Investment Banking, Wealth Management & Insurance, and Payments. It offers demand and time deposits, mutual funds, and current and savings accounts; mortgages, consumer finance, loans, and various financing solutions; and project finance, debt capital markets, global transaction banking, and corporate finance services. The company also provides credit and debit cards, real estate loans, microfinance, and auto loans; private and investment banking services; advice on mergers and acquisitions; wealth, asset, and risk management services; and digital payments and technology solutions. In addition, it is involved in the securitization, leasing, management of portfolios, e-commerce, air transport, aircraft rental, software, consulting, payment and collection, fund and investment management, renewable energy, vehicle rental, insurance, advertising, marketing, telemarketing, automotive, agricultural, factoring, securities brokerage and investment, pension fund management, trade intermediary, venture capital fund, renting, restaurant, electricity production, IT, internet, and financial advisory and other activities; management, rental, and other real estate activities; and purchase and sale of vehicles. Further, the company offers mobile and online banking services. Banco Santander, S.A. was formerly known as Banco Santander Central Hispano SA and changed its name to Banco Santander, S.A. in February 2007. Banco Santander, S.A. was incorporated in 1856 and is headquartered in Madrid, Spain.", "sector": "Financial Services", "industry": "Banks - Diversified", "employees": 204770, "website": "https://www.santander.com", "city": "Madrid", "country": "Spain", "currency": "EUR", "price": 10.53600025177002, "change": -0.0039997100830078125, "changePercent": -0.03794791363836615, "dayLow": 10.411999702453613, "dayHigh": 10.53600025177002, "volume": 20480380, "open": 10.496000289916992, "previousClose": 10.539999961853027, "marketCap": 154752712704, "trailingPE": 12.542858, "forwardPE": 10.951956, "trailingEps": 0.84, "dividendYield": 2.18, "dividendRate": 0.23, "priceToBook": 1.5444151, "profitMargins": 0.26841998, "beta": 0.974, "fiftyTwoWeekHigh": 10.628, "fiftyTwoWeekLow": 4.645, "averageVolume": 25095130, "totalRevenue": 50673999872, "grossProfits": 50673999872, "totalCash": 420011016192, "totalDebt": 372550991872, "ebitda": null, "lastUpdated": "2026-01-18T14:11:56.883848Z"}