{"symbol": "SBK.JO", "name": "Standard Bank Group Limited", "description": "Standard Bank Group Limited provides financial products and services in South Africa and internationally. It offers a range of onshore and offshore savings and investment; home and personal loans; forex solutions; transactional banking, including digital wallets, cards, payment and transfer platforms; private and digital banking; forex solutions; vehicle and asset finance; credit cards; and insurance solutions. The company also provides transactional banking; business lending; commercial asset finance; merchant, trade, fleet, and business solar solutions; specific solutions for clients in various sectors, such as agriculture, manufacturing, healthcare, and tourism; app and internet banking; international payments and forex; alternative funding options; and business resources and insurance. In addition, it offers advisory, transactional, trading, risk management, and funding solutions; and long and short-term insurance, health insurance, and asset management. Further, the company engages in trust or other fiduciary activities. Standard Bank Group Limited was founded in 1862 and is headquartered in Johannesburg, South Africa.", "sector": "Financial Services", "industry": "Banks - Regional", "employees": 50488, "website": "https://www.standardbank.com/sbg/standard-bank-group", "city": "Johannesburg", "country": "South Africa", "currency": "ZAc", "price": 28862.0, "change": 42.0, "changePercent": 0.1457321304649549, "dayLow": 28401.0, "dayHigh": 29101.0, "volume": 3009908, "open": 28822.0, "previousClose": 28820.0, "marketCap": 467314343936, "trailingPE": 10.3932295, "forwardPE": 8.957701, "trailingEps": 27.77, "dividendYield": 5.66, "dividendRate": 16.34, "priceToBook": 167.67267, "profitMargins": 0.27885, "beta": 0.5, "fiftyTwoWeekHigh": 29921.0, "fiftyTwoWeekLow": 227.47, "averageVolume": 2771116, "totalRevenue": 172658999296, "grossProfits": 172658999296, "totalCash": 669630005248, "totalDebt": 101364998144, "ebitda": null, "lastUpdated": "2026-01-18T14:13:13.958367Z"}