{"symbol": "SIE.DE", "name": "Siemens Aktiengesellschaft", "description": "Siemens Aktiengesellschaft, a technology company, focuses in the areas of automation and digitalization in Europe, Commonwealth of Independent States, Africa, the Middle East, the Americas, Asia, and Australia. It operates through Digital Industries, Smart Infrastructure, Mobility, Siemens Healthineers, and Siemens Financial Services (SFS) segments. The Digital Industries segment provides automation systems and software for factories, numerical control systems, servo motors, drives and inverters, and integrated automation systems for machine tools and production machines; process control systems, machine-to-machine communication products, sensors and radio frequency identification systems; production and product lifecycle management software, and simulation and testing of mechatronic system. The Smart Infrastructure segment offers products, systems, solutions, services, and software to support sustainable transition from fossil and renewable energy  sources; sustainable buildings and communities; and buildings, electrification, and electrical products. The Mobility segment provides rail passenger and freight transportation, such as metro systems, trams and light rail, and commuter trains, as well as trains and passenger coaches; locomotives and solutions for automated transportation and leasing; products and solutions for rail automation and electrification; maintenance and digital services; and digital and cloud-based solutions, and related services. The Siemens Healthineers segment develops, manufactures, and sells various diagnostic and therapeutic products and services; and provides clinical consulting and training services. The Siemens Financial Services segment offers debt and equity investments; leasing, lending, and working capital; structured, equipment, and project financing; and financial advisory services. The company was founded in 1847 and is headquartered in Munich, Germany.", "sector": "Industrials", "industry": "Specialty Industrial Machinery", "employees": 303061, "website": "https://www.siemens.com", "city": "Munich", "country": "Germany", "currency": "EUR", "marketCap": 203832344576, "trailingPE": 27.3085, "forwardPE": 20.203611, "trailingEps": 9.53, "dividendYield": 2.06, "dividendRate": 5.35, "priceToBook": 3.2623818, "profitMargins": 0.12189999, "beta": 1.155, "fiftyTwoWeekHigh": 263.15, "fiftyTwoWeekLow": 162.38, "averageVolume": 890633, "totalRevenue": 78914002944, "grossProfits": 30399000576, "totalCash": 15518999552, "totalDebt": 56014999552, "ebitda": 11475999744, "lastUpdated": "2026-01-18T13:28:40.693042Z"}