{"symbol": "SOL.JO", "name": "Sasol Limited", "description": "Sasol Limited operates as a chemical and energy company. It offers bitumen, industrial heating fuels, naphtha, lubricants and lubricant base oils, liquefied petroleum gas, automotive and industrial lubricants, greases, cleansers and degreasers, automotive fuels, and burner fuels or domestic, as well as illuminating paraffin transport fuels, such as petrol, diesel, and jet fuels. The company also provides methane rich and natural gas. In addition, it offers ammonium nitrate, limestone ammonium nitrate, and nitric acid for agriculture; industrial foaming agents, wax/hydrophobic coatings and industrial pegs, dispersible hydrates, boehmites, and aluminum oxides for building and construction; short-chain alcohols for flavors and fragrances; liquids, flakes, powders, and polyethylene glycols for health and wellness; caustic soda, hydrochloric acid CP Grade, and calcium chloride for industrial and institutional cleaning; alumina-based catalyst, cobalt FT catalysts, and mixed metal oxides for inorganic materials and catalysts; chemical feedstocks, process solvents, and chemicals for manufacturing and industrial; viscosity modifiers, chemical carriers, and adsorbents for mining, oil, and gas; hydrocarbons, surfactants, polyether, and polyglycols for paper and water; surfactants, dyes, finishing agents, tanning agents, and emulsifiers for textile and leather; and other chemicals for automotive and transportation, consumer goods, home care, packaging, printing, coatings, personal care, and polymers sectors. Further, it is involved in engineering services, research and development, and technology transfer; management of cash resources, investments, and procurement of loans; develop and implement international gas to liquid and CTL ventures; marketing of fuels and lubricants; trading and transportation of oil products, petrochemicals and chemical products, and derivatives; and coal mining activities. Sasol Limited was founded in 1950 and is based in Johannesburg, South Africa.", "sector": "Basic Materials", "industry": "Specialty Chemicals", "employees": 27107, "website": "https://www.sasol.com", "city": "Johannesburg", "country": "South Africa", "currency": "ZAc", "price": 10191.0, "change": -1367.0, "changePercent": -11.827305762242602, "dayLow": 10177.0, "dayHigh": 11541.0, "volume": 5201530, "open": 11550.0, "previousClose": 11558.0, "marketCap": 64971460608, "trailingPE": 9.66888, "forwardPE": 3.3451974, "trailingEps": 10.54, "dividendYield": null, "dividendRate": null, "priceToBook": 43.1168, "profitMargins": 0.02717, "beta": 0.175, "fiftyTwoWeekHigh": 12909.0, "fiftyTwoWeekLow": 5301.0, "averageVolume": 2794971, "totalRevenue": 249095995392, "grossProfits": 104431001600, "totalCash": 44222001152, "totalDebt": 120672002048, "ebitda": 49150001152, "lastUpdated": "2026-01-18T14:13:12.820020Z"}