{"symbol": "TEF.MC", "name": "Telefónica, S.A.", "description": "Telefónica, S.A., together with its subsidiaries, provides telecommunications services in Europe and Latin America. The company offers mobile and related services and products, including mobile voice, value added, mobile data and internet, wholesale, corporate, roaming, fixed wireless, and trunking and paging services; traditional fixed telecommunication services, such as PSTN lines; ISDN accesses; public telephone services; local, domestic, and international long-distance and fixed-to-mobile communications; corporate communications; supplementary value-added services; video telephony; intelligent network; telephony information services; and leases and sells handset equipment. It also provides internet provider service; portal and network, retail and wholesale broadband access, narrowband switched access and other technologies, internet through fibre to the home, very high bit-rate digital subscriber line, and voice over internet protocol services; leased line, virtual private network, fibre optics, web and managed hosting, content delivery and application, security, and outsourcing and consultancy services, including network management or CGP; and desktop, system integration, and professional services. In addition, the company offers wholesale services for telecommunication operators, such as domestic interconnection and international wholesale services; leased lines for other operators; and local loop leasing services, as well as bit stream services, wholesale line rental accesses, and leased ducts for other operators' fiber deployment. Further, it provides video/TV services; smart connectivity and services; financial and other payment, cloud, security, advertising, and big data services; digital products; Aura, an artificial-intelligence ecosystem; Movistar Home device; open gateway; living apps; smart Wi-Fi; NT; Solar 360; and Phoenix, a digital sales platform. Telefónica, S.A. was incorporated in 1924 and is headquartered in Madrid, Spain.", "sector": "Communication Services", "industry": "Telecom Services", "employees": 100870, "website": "https://www.telefonica.com", "city": "Madrid", "country": "Spain", "currency": "EUR", "marketCap": 18831648768, "trailingPE": null, "forwardPE": 10.088886, "trailingEps": -0.19, "dividendYield": 8.99, "dividendRate": 0.3, "priceToBook": 1.06784, "profitMargins": -0.05005, "beta": 0.279, "fiftyTwoWeekHigh": 4.893, "fiftyTwoWeekLow": 3.32, "averageVolume": 15207652, "totalRevenue": 41620000768, "grossProfits": 22698999808, "totalCash": 4392000000, "totalDebt": 42903998464, "ebitda": 9473000448, "lastUpdated": "2026-01-18T13:30:51.682612Z"}