{"symbol": "TRP.TO", "name": "TC Energy Corporation", "description": "TC Energy Corporation operates as an energy infrastructure company in North America. It operates through four segments: Canadian Natural Gas Pipelines; U.S. Natural Gas Pipelines; Mexico Natural Gas Pipelines; and Power and Energy Solutions. The company builds and operates a network of 93,700 kilometers of natural gas pipelines, which transports natural gas from supply basins to local distribution companies, power generation plants, industrial facilities, interconnecting pipelines, LNG export terminals, and other businesses. It also has regulated natural gas storage facilities with a total working gas capacity of 532 billion cubic feet. Further, the company owns or has interests in power generation facilities with approximately 4,650 megawatts; and owns and operates approximately 118 billion cubic feet of non-regulated natural gas storage facilities in Alberta, Ontario, Québec, and New Brunswick. The company was formerly known as TransCanada Corporation and changed its name to TC Energy Corporation in May 2019. TC Energy Corporation was founded in 1951 and is headquartered in Calgary, Canada.", "sector": "Energy", "industry": "Oil & Gas Midstream", "employees": 6668, "website": "https://www.tcenergy.com", "city": "Calgary", "country": "Canada", "currency": "CAD", "price": 76.41000366210938, "change": 0.9300003051757812, "changePercent": 1.2321148169243574, "dayLow": 75.44000244140625, "dayHigh": 76.54000091552734, "volume": 4672400, "open": 75.44000244140625, "previousClose": 75.4800033569336, "marketCap": 79542812672, "trailingPE": 21.343576, "forwardPE": 20.308739, "trailingEps": 3.58, "dividendYield": 4.45, "dividendRate": 3.4, "priceToBook": 3.186007, "profitMargins": 0.23915, "beta": 0.956, "fiftyTwoWeekHigh": 77.76, "fiftyTwoWeekLow": 62.17, "averageVolume": 5235880, "totalRevenue": 14648000512, "grossProfits": 9989000192, "totalCash": 2172000000, "totalDebt": 61399998464, "ebitda": 9267000320, "lastUpdated": "2026-01-18T14:10:56.613594Z"}