{"symbol": "UBSG.SW", "name": "UBS Group AG", "description": "UBS Group AG provides financial advice and solutions to private, institutional, and corporate clients worldwide. It operates through five divisions: Global Wealth Management, Personal & Corporate Banking, Asset Management, Investment Bank, and Non-core and Legacy. The company offers investment advice, estate and wealth planning, investing, corporate and banking, and investment management, as well as mortgage, securities-based, and structured lending solutions. It also provides personal banking products and services, such as deposits, credit and debit cards, and online and mobile banking, as well as lending, investments, retirement, and wealth management services; and corporate and institutional solutions, including equity and debt capital markets, syndicated and structured credit, private placements, leasing, traditional financing, and transaction banking solutions for payment and cash management services, trade and export finance, and global custody solutions. In addition, the company offers equities, fixed income, hedge funds, real estate and private markets, indexed and alternative beta strategies, asset allocation and currency investment strategies, customized multi-asset solutions, advisory and fiduciary services, and multi-manager hedge fund solutions and advisory services. Further, it advises clients on strategic business opportunities and helps them raise capital to fund their activities; enables its clients to buy, sell, and finance securities on capital markets and to manage risks and liquidity; distributes, trades in, finances, and clears cash equities and equity-linked products; structures, originates, and distributes new equity and equity-linked issues; and originates, distributes, manages risk, and provides liquidity in foreign exchange, rates, credit and precious metals. The company was formerly known as UBS AG and changed its name to UBS Group AG in December 2014. UBS Group AG was founded in 1862 and is headquartered in Zurich, Switzerland.", "sector": "Financial Services", "industry": "Banks - Diversified", "employees": 108648, "website": "https://www.ubs.com", "city": "Zurich", "country": "Switzerland", "currency": "CHF", "marketCap": 120492072960, "trailingPE": 21.35955, "forwardPE": 14.689576, "trailingEps": 1.78, "dividendYield": 1.93, "dividendRate": 0.73, "priceToBook": 1.652846, "profitMargins": 0.15226, "beta": 0.927, "fiftyTwoWeekHigh": 38.39, "fiftyTwoWeekLow": 20.66, "averageVolume": 5746273, "totalRevenue": 48192999424, "grossProfits": 48192999424, "totalCash": 527066988544, "totalDebt": 552676032512, "ebitda": null, "lastUpdated": "2026-01-18T13:30:10.985629Z"}