{"symbol": "ZURN.SW", "name": "Zurich Insurance Group AG", "description": "Zurich Insurance Group AG provides insurance products and related services in Europe, the Middle East, Africa, North America, Latin America, and the Asia Pacific. The company operates through Property & Casualty Regions, Life Regions, Farmers, Group Functions and Operations, and Non-Core Businesses segments. It offers car and motor, home, travel, general liability, life and critical illness, and other insurance products; and saving and investment, and pension and retirement planning products. The company also provides property, casualty, energy and engineering lines, and marine; commercial management liability, financial institutions, and professional indemnity; and cyber, accident and health, and credit lines and surety insurance products, as well as non-claims and ancillary services to the farmers exchanges. In addition, it offers employee benefit insurance products; and climate resilience, risk engineering, captive, cyber resilience, climate risk assessment, and reinsurance services. The company serves individuals, small businesses, mid-sized and large companies, and multinational corporations. It sells its products through agents, brokers, and bank distribution channels. Zurich Insurance Group AG was founded in 1872 and is based in Zurich, Switzerland.", "sector": "Financial Services", "industry": "Insurance - Diversified", "employees": 63000, "website": "https://www.zurich.com", "city": "Zurich", "country": "Switzerland", "currency": "CHF", "marketCap": 83111133184, "trailingPE": 17.73272, "forwardPE": 14.915311, "trailingEps": 32.55, "dividendYield": 4.85, "dividendRate": 28.0, "priceToBook": 4.143486, "profitMargins": 0.08396, "beta": 0.399, "fiftyTwoWeekHigh": 625.2, "fiftyTwoWeekLow": 519.6, "averageVolume": 231891, "totalRevenue": 69708996608, "grossProfits": 15379000320, "totalCash": 29974999040, "totalDebt": 15811999744, "ebitda": 8828999680, "lastUpdated": "2026-01-18T13:30:14.152169Z"}