[{"title":"Egypt forecasts economic growth of at least 5% this fiscal year, minister tells IMF","url":"https://www.zawya.com/en/economy/north-africa/egypt-forecasts-economic-growth-of-at-least-5-this-fiscal-year-minister-tells-imf-xhvujk6g","published_at":"Sun, 07 Dec 2025 21:45:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSEGYPTIMFECONOMYEgypt expects its economy to grow by at least 5% by the end of the current fiscal year, supported by a continued pace of structural reforms, Planning Minister Rania Al-Mashat said on Saturday. Speaking during a meeting with an International Monetary Fund (IMF) mission in Cairo, Al-Mashat reported that Gross Domestic Product (GDP) growth reached 5.3% in the first quarter of the year, a div she described as exceeding expectations. The talks were held as part of the fifth and sixth reviews of Egypt’s economic reform programme. Al-Mashat attributed the first-quarter performance to improvements in industrial production, citing increased growth rates in sectors such as vehicles, textiles, and ready-made garments. She stated this indicates a shift toward high-productivity, tradable sectors. To maintain macroeconomic stability, the minister highlighted the government’s adherence to a public investment ceiling of EGP 1trn last fiscal year. She noted that limiting public spending had “opened the way for more private-sector investments”. On structural reforms, Al-Mashat pointed to the establishment of a State-Owned Enterprises Unit. The unit has been granted a mandate to maximise asset value and determine the most appropriate scenarios for state-owned companies, in line with the State Ownership Policy Document aimed at empowering the private sector. The minister also presented “Egypt’s Narrative for Economic Development,” a framework designed to transform th","tickers":[]},{"title":"Egypt’s tax revenues rise by $12.64bln as private sector boosts investment in FY 2024/25","url":"https://www.zawya.com/en/economy/north-africa/egypts-tax-revenues-rise-by-1264bln-as-private-sector-boosts-investment-in-fy-2024-25-bewwpnv3","published_at":"Sun, 07 Dec 2025 21:18:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSECONOMYSMEEGYPTTAXATIONEgypt - Finance Minister Ahmed Kouchouk said the private sector’s strong response to the government’s tax-relief initiative has encouraged the ministry to launch a second package. He highlighted that tax revenues increased by EGP 600bn during the last fiscal year without imposing any additional burdens, thanks to a confidence-based partnership framework with the business community. Speaking at an open dialogue with students at Nile University, Kouchouk noted that the 73% jump in private investment reflects tangible economic improvement. “No one risks their money out of courtesy,” he said, describing this as a strong step toward restoring private-sector confidence and incentivising its role as the engine of economic growth. The minister stressed that the government’s primary focus is to increase state resources to enhance citizens’ quality of life. “We need to grow revenues to improve spending on healthcare, education, and social protection,” he said. Kouchouk also explained that Egypt’s economic and fiscal policies prioritise supporting production and exports across all sectors, including human capital. He emphasised that Egypt remains open to global investors, offering increasingly diverse and competitive economic opportunities. “The economy is in good shape, and what is coming is even better with rising private investment,” he noted. To simplify compliance, the ministry plans to provide tax services via a dedicated mobile application and","tickers":[]},{"title":"Top MENA PMIs for November 2025 – Recap","url":"https://english.mubasher.info/news/4533321/Top-MENA-PMIs-for-November-2025-Recap/","image_url":"https://static.mubasher.info/File.Story_Image/5935221df9caba382ff24425d4f0763d/640.jpg","content":"<iframe height=\"0\" src=\"https://www.googletagmanager.com/ns.html?id=GTM-NM7L484\" style=\"display:none;visibility:hidden\" width=\"0\"></iframe> Top MENA PMIs for November 2025 – Recap Photo Archive 08 December 2025 12:18 AM Mubasher: A report by Emirates NBD Research summarized the Purchasing Managers’ Index (PMI) data for the top MENA countries, with the S&P Global PMI for the UAE rising to a value of 54.8 in November, up from 53.8 in October 2025. Meanwhile, the headline S&P Global PMI for the Emirate of Dubai remained unchanged at 54.5 in November. For Saudi Arabia, the Kingdom’s PMI survey for November went down slightly to 58.5. This was compared to a strong 60.2 in October. In Egypt, the S&P Global PMI rose to 51.1 in November from 49.2 a month earlier, marking the first expansion in private sector activity since February 2025. Global Economy Macroeconomics Sector Reports Source: Mubasher Related News INK PharmaSolutions strengths regional presence through collaboration with AstroLabs Global Economy Prices of investment funds including certificates in EGP, USD – Update Trading Activities World’s 1st fintech-enabled Gold ATM launches in UAE Global Economy DEWA’s Moro Hub joins PwC Middle East to drive tech initiatives across region Companies Investments Trending {{details.article.title}} This news story is part of Mubasher Exclusive Services. If you would like to subscribe please click here or alternatively wait {{hours}} hr {{minutes}} min {{seconds}} sec to read it for fre","published_at":"Mon Dec 08 00:18:48 UTC 2025","source":"Mubasher","country":"EG","market":"EGX","tickers":[]},{"title":"Concrete Fashion Group’s consolidated net profits exceed $6.5m in 9M-25","url":"https://english.mubasher.info/news/4531782/Concrete-Fashion-Group-s-consolidated-net-profits-exceed-6-5m-in-9M-25/","image_url":"https://static.mubasher.info/File.Story_Image/988ef7934eb86710a27d77dab1e4826a/640.jpg","content":"<iframe height=\"0\" src=\"https://www.googletagmanager.com/ns.html?id=GTM-NM7L484\" style=\"display:none;visibility:hidden\" width=\"0\"></iframe> Concrete Fashion Group’s consolidated net profits exceed $6.5m in 9M-25 Photo Archive 03 December 2025 12:39 PM Concrete Fashion Group CFGH 4.54% 0.12 0.01 Cairo - Mubasher: Concrete Fashion Group for Commercial and Industrial Investments registered lower consolidated net profits after tax at $6.59 million in the first nine months (9M) of 2025, compared to $11.72 million during the February-September 2024 period, according to the financial results. It is worth noting that the fiscal year (FY) of Concrete Fashion Group was previously from February to the following January. Meanwhile, starting in 2025, the company shifted to a January-December financial year. The basic and diluted earnings per share (EPS) decreased to $0.01 in 9M-25 from $0.02 in the February-September 2024 period. Consolidated revenues stood at $110.54 million in the January-September 2025 period, which signaled an increase from $102.01 million. Moreover, the consolidated total assets rose to $198.69 million as of 30 September 2025 when compared to $199.15 million in the twelve-month period that ended on 31 December 2024. Standalone Results for 9M-25 The non-consolidated net losses after tax shrank to $357,539 in 9M-25 from $681,105 in the February-September 2024 period, while the basic and diluted loss per share retreated to $0.008 from $0.0014. The EGX-listed group recor","published_at":"Wed Dec 03 12:39:06 UTC 2025","source":"Mubasher","country":"EG","market":"EGX","tickers":["EGX"]},{"title":"Dr. Rania Al-Mashat reviews Egypt’s efforts in implementing the first and second phases of the Universal Health Insurance System","url":"https://www.zawya.com/en/press-release/africa-press-releases/dr-rania-al-mashat-reviews-egypts-efforts-in-implementing-the-first-and-second-phases-of-the-universal-health-kufz677s","image_url":"https://www.africa-newsroom.com/files/large/0a4db166a2eb25b","published_at":"Sun, 07 Dec 2025 08:16:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSAFRICA H.E. Dr. Rania Al-Mashat, Minister of Planning, Economic Development, and International Cooperation, participated in the 2025 High-Level Forum on Universal Health Coverage, as head of the Egyptian delegation, which included Dr. Ahmed El-Sobky, Chairman of the Healthcare Authority, and Ms. Mai Farid, Executive Director of the General Authority for Universal Health Insurance. The forum is organized by the Government of Japan, in cooperation with the World Health Organization (WHO) and the World Bank Group, in Tokyo, Japan, with the participation of senior government officials and international institutions, including Mr. Ajay Banga, President of the World Bank; Ms. Sanae Takaichi, Prime Minister of Japan; Dr. Tedros Adhanom Ghebreyesus, Director-General of the World Health Organization; and Dr. Budi Gunadi Sadikin, Minister of Health of Indonesia. The forum witnessed the launch of the Universal Health Coverage (UHC) Knowledge Hub, an innovative platform established by the Government of Japan, the World Bank, and the World Health Organization to strengthen the exchange of experience and knowledge and support national healthcare policies. It includes Egypt alongside Nigeria, the Philippines, Kenya, Indonesia, Ghana, Cambodia, and Ethiopia. In her remarks, H.E. Dr. Rania Al-Mashat stated that this pivotal event renews global commitment to an issue that lies at the heart of human development, affirming that Egypt believes that healthcare is a right for every ci","tickers":[]},{"title":"Egypt pushes tech growth beyond Cairo as ITIDA highlights new momentum in regional digital hubs","url":"https://www.zawya.com/en/press-release/companies-news/egypt-pushes-tech-growth-beyond-cairo-as-itida-highlights-new-momentum-in-regional-digital-hubs-wnfaznuj","image_url":"https://static.zawya.com/view/acePublic/alias/contentid/e53b8a91-37f7-47b1-a859-bfa33d633203/0/mansoura-jpg.jpeg?f=3%3A2","published_at":"Sun, 07 Dec 2025 06:00:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSTECHNOLOGYRELATED COMPANIESInformation TechQTechPHOTOCairo — Egypt is broadening its technology ambitions beyond its capital city, with the Information Technology Industry Development Agency (ITIDA) presenting new data that underscores the rise of regional innovation centres and the country’s growing appeal as a hub for digital services, engineering, and offshoring. In a trend rarely seen across the Middle East and Africa, Egyptian tier 2 cities are emerging as credible alternatives for global companies seeking distributed, multilingual talent. ITIDA’s latest update spotlights Creativa Innovation Hub in Mansoura — now one of the most active local centres supporting tech upskilling, freelance employment and startup creation. A Regional Model for Tech Growth Since its establishment, Creativa Innovation Hub in Mansoura city has: Trained 11,600+ young people in digital and technical skills Supported 2,000+ entrepreneurs Helped develop 1,500+ digital prototypes Enabled more than 2,030 freelancers to access new income streams Hosted 19 hackathons and innovation challenges Built a growing pipeline of healthtech and AI-driven solutions startups In 2025 alone, ITIDA supported 32+ startups, trained 2,400+ new participants, and provided services to 900+ freelancers, who reported an average annual income of $18,200 — a figure that marks a growing contribution of the gig economy to small and mid-sized cities. The Creativa Innovation Hub in Mansoura is one of nationwide netwo","tickers":[]},{"title":"DXC Egypt becomes regional SAP Centre Excellence for MEA Transformation","url":"https://www.zawya.com/en/economy/north-africa/dxc-egypt-becomes-regional-sap-centre-excellence-for-mea-transformation-iuhy7g29","image_url":"https://static.zawya.com/view/acePublic/alias/contentid/OWNmNTA4Y2MtN2U2ZS00/205/1833379465.jpeg?f=3%3A2","published_at":"Tue, 02 Dec 2025 02:46:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSEGYPTNORTH AFRICATECHNOLOGYPHOTO Arab Finance: Egypt's information and communications technology (ICT) sector is experiencing rapid expansion, with the sector's contribution to gross domestic product (GDP) reaching 5.8% in fiscal year (FY) 2023/2024, up from 5% the previous year, with expectation to reach 8% by 2030, according to the Information Technology Industry Development Agency (ITIDA). The sector achieved revenues of EGP 315 billion in the current fiscal year, with a growth rate of about 75%. Meanwhile, digital export revenues surged from $2.4 billion in 2022 to $4.8 billion in 2025, the agency revealed. The number of offshoring companies operating in Egypt more than doubled during the same period, from 90 to over 240, spanning information technology (IT), business process outsourcing, and engineering research and development services, as reported by ITIDA. Within this thriving ecosystem, DXC Technology Egypt has positioned itself as a strategic digital hub, delivering end-to-end technology and business solutions across Europe, the Middle East, and Africa as part of a Fortune 500 global technology services provider operating in over 70 countries. The company recently announced plans to hire 250 SAP professionals and establish a new SAP Centre of Excellence, making Egypt the company's largest hub for SAP skills in the Middle East and Africa region. Hence, we sat with Neveen Galal, DXC Egypt Managing Director, to discuss the company’s strategy in Egypt. She","tickers":[]},{"title":"Prices of investment funds including certificates in EGP, USD – Update","url":"https://english.mubasher.info/news/4533121/Prices-of-investment-funds-including-certificates-in-EGP-USD-Update/","image_url":"https://static.mubasher.info/File.Story_Image/b04d3003532db7b96658a2aef4cbad26/640.jpg","content":"<iframe height=\"0\" src=\"https://www.googletagmanager.com/ns.html?id=GTM-NM7L484\" style=\"display:none;visibility:hidden\" width=\"0\"></iframe> Prices of investment funds including certificates in EGP, USD – Update Photo Archive 07 December 2025 03:40 PM Cairo – Mubasher: According to updated data, Mubasher is featuring mutual funds along with relevant prices based on the latest closing. Below you can find the names of Investment Funds as well as the price of each certificate in EGP, except for the funds of Azimut Target Maturity as well as Maksab–OZ –Fixed Income that are offered in USD, as of 6 December 2025. Fund Name: Azimut Fixed Income Fund - Idkhar AZ (az-ادخار) Price per Certificate (EGP): 19.18682 Fund Name: NI Capital Cumulative Daily Return Money Market Fund (Siula) Price per Certificate (EGP): 21.50277 Fund Name: Afaaq Investment Fund (Afaaq Fund) Price per Certificate (EGP): 232.0857 Fund Name: Azimut Equity Opportunities Fund (az-فرص) Price per Certificate (EGP): 39.28118 Fund Name: Wethaq Money Market Fund (Wethaq Investment) Price per Certificate (EGP): 20.45404 Fund Name: Misr Takaful Islamic Sharia Compliant Fund (Misr Takaful Money Market) Price per Certificate (EGP): 186.17513 Fund Name: CI Assets Management Investment Fund (Misr Equity – CIAM) Price per Certificate (EGP): 28.54356 Fund Name: Mubasher Capital Daily Cumulative Return Fund (Cash Mubasher) Price per Certificate (EGP): 21.24463 Fund Name: Misr Insurance – Istsmar w Aman Price per Certificate (EGP)","published_at":"Sun Dec 07 15:40:29 UTC 2025","source":"Mubasher","country":"EG","market":"EGX","tickers":[]},{"title":"Egypt unveils new incentive package to attract Australian mining investment","url":"https://www.zawya.com/en/economy/north-africa/egypt-unveils-new-incentive-package-to-attract-australian-mining-investment-nj3if92z","image_url":"https://static.zawya.com/view/acePublic/alias/contentid/image.180723102024ZAFZ/121/180723102024zafz-jpg.jpeg?f=3%3A2","published_at":"Tue, 02 Dec 2025 02:45:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSINVESTMENTAUSTRALIAEGYPTNORTH AFRICAHYDROGENTECHNOLOGYENERGYMININGPHOTO Arab Finance: Egypt’s Minister of Petroleum and Mineral Resources Karim Badawi announced a new incentive package aimed at attracting emerging and medium-sized Australian mining companies to explore and develop mineral resources in Egypt, according to a statement. The announcement came during his visit to Perth, a major global mining hub. Badawi outlined the initiative during an Explore in Egypt meeting attended by more than 30 Australian companies and institutions interested in mining opportunities in the country. He said the incentive package accompanies a series of new reforms designed to position Egypt as one of the leading mining destinations in Africa and the Middle East. The reforms include reducing annual fees to make the early stages of exploration more viable, along with tax and customs exemptions for equipment, supplies, and related services. These changes aim to lower upfront costs and ease financial burdens for mining startups and medium-sized enterprises. The minister added that companies will have the flexibility to license multiple types of minerals under a single operating license, reflecting the geological nature of mineral-rich areas and reducing the costs and procedures associated with multiple licenses. He noted that Egypt has begun issuing reconnaissance licenses designed as fast, low-cost permits suitable for startups seeking to assess potential deposits before committi","tickers":[]},{"title":"Clean-Energy IPOs: Egypt’s next economic shift","url":"https://www.zawya.com/en/economy/north-africa/clean-energy-ipos-egypts-next-economic-shift-c8aoz0bt","image_url":"https://static.zawya.com/view/acePublic/alias/contentid/ZTkzYmFkNmQtMmIxZi00/124/861587784.jpeg?f=3%3A2","published_at":"Tue, 02 Dec 2025 02:45:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSECONOMYEGYPTNORTH AFRICAPETROCHEMICALSFOODPHARMACEUTICALRENEWABLE ENERGYIPOPHOTOEgypt’s 2025 Initial Public Offering (IPO) program represents a pivotal moment in the country’s economic reform agenda. Driven by the government’s broader push for privatization, the program targets strategic sectors including petroleum, food industries, pharmaceuticals, plastics, banking, and—most notably—renewable energy. Closely tied to Egypt’s commitments under International Monetary Fund (IMF) agreements, this initiative aims to reduce the state’s footprint in the economy, enhance private sector participation, and secure much-needed funding for fiscal stability. By aligning IPO targets with IMF requirements, Egypt seeks to unlock foreign investments and reinforce its credibility in global markets. Clean Energy as a Part of Egypt’s Privatization Drive In 2025, the government committed to privatizing 10 state-owned enterprises (SOEs) across strategic sectors. Ahmed Fawzy Hussein, a PhD holder and an assistant professor of economics, tells Arab finance: “In a world of higher interest rates and tighter external financing, IPOs are a strategic way for Egypt to shift part of the financing burden from sovereign and bank debt towards long-term equity capital. This is especially important in renewables, where investment needs are huge.” Under the IMF’s $3 billion loan program, launched in 2022, Egypt pledged to curb the state’s dominance in the economy and expand private sector involveme","tickers":[]},{"title":"Egypt stocks down, losing 1.6 b EGP","url":"https://www.zawya.com/en/business/egypt-stocks-down-losing-16-b-egp-lwyn5nbi","published_at":"Sat, 06 Dec 2025 09:42:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"07 December 2011 CAIRO: Egypt stocks declined at the final transactions on Wednesday December 7 due to Arab and Foreign shareholders' sell-off, reaching 4000 points. Although Egyptian shareholders' purchases pushed the share to go up during the morning session and mid-session, the main indexes closed in the red zone, losing 1.6 billion EGP (U.S. $266.44 million). Main index EGX30 declined 0.70 percent at 3996 points. The indexes EGX20, EGX70 and EGX100 went down by 0.35 percent, 0.69 percent, 0.70 percent, respectively. The Egyptian shareholders' dealings got 50.76 percent of total transactions, gaining 49.2 million EGP (U.S. $8.2 billion). Arab shareholders obtained 3.31 percent to get 8.06 percent as net profit. Foreign shareholders' dealings reached 45.93 percent, gaining 41.2 million EGP (U.S. $6.86) as net profit. © Al-Youm Al-Sabea 2011","tickers":["EGX"]},{"title":"Egypt: President El-Sisi Meets Prime Minister and Minister of Education and Technical Education","url":"https://www.zawya.com/en/press-release/africa-press-releases/egypt-president-el-sisi-meets-prime-minister-and-minister-of-education-and-technical-education-mve2jk5i","image_url":"https://www.africa-newsroom.com/files/large/04cd40fd065257d","published_at":"Sat, 06 Dec 2025 05:30:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSAFRICA Today, President Abdel Fattah El-Sisi met with Prime Minister Dr. Mostafa Madbouly, and Minister of Education and Technical Education Mr. Mohamed Abdel Latif. Spokesman for the Presidency Ambassador Mohamed El-Shennawy stated that the meeting reviewed several ministry work files. The Minister of Education and Technical Education offered a presentation on the execution status of teaching Programming and Artificial Intelligence (AI) as part of the curricula for the first year of secondary school, starting from the current academic year 2025/2026. In this regard, the minister highlighted that the inclusion of this subject is part of the State's vision for digital transformation and educational development, and meets the requirements of the technological revolution and its associated changes in the labor market. The minister pointed out that the demand for the Japanese \"QUREO\" Programming and AI platform has exceeded all expectations, with over 236,000 students completing the full training content. He explained that secondary stage graduates who study the subject receive an accredited international certificate in programming from Hiroshima University in Japan. In the same context, the Minister added that the Programming and AI subject will also be introduced in Technical Education starting from the academic year 2026/2027. The meeting also reviewed the Ministry of Education's efforts to develop the technical education system through the expansion of Applied T","tickers":[]},{"title":"Egypt: President El-Sisi Meets Japanese Education Experts","url":"https://www.zawya.com/en/press-release/africa-press-releases/egypt-president-el-sisi-meets-japanese-education-experts-vwpug4b8","image_url":"https://www.africa-newsroom.com/files/large/04cd40fd065257d","published_at":"Sat, 06 Dec 2025 05:22:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSAFRICA Today, President Abdel Fattah El-Sisi met with a group of Japanese education experts currently in Egypt. The meeting was attended by Prime Minister Dr. Mostafa Madbouly, and Minister of Education and Technical Education Mr. Mohamed Abdel Latif. Spokesman for the Presidency Ambassador Mohamed El-Shennawy stated that President El-Sisi commenced by welcoming the Japanese experts. The President emphasized the importance of the partnership with Japan in supporting the educational process in Egypt, as part of the continuous commitment to strengthening educational relations with Japan and benefiting from its pioneering experience in developing education. President El-Sisi also lauded the role of the Japanese experts in joint educational projects, particularly their contribution to supporting the educational process within the Japanese schools in Egypt. The President expressed his appreciation for the Japanese character and its outstanding capabilities, discipline, and high efficiency. The Japanese experts expressed their deep gratitude to President El-Sisi for his support and keenness on the success of the Japanese schools experience in Egypt, and for the tangible positive results achieved. They reaffirmed their commitment to establishing the foundations of the Japanese education system in Egypt, including teacher training and curriculum development. They noted that the eight-year evaluation of the project, which currently includes 69 schools, has been extremely","tickers":[]},{"title":"Egypt: Infinity Power breaks ground on 200-MW Ras Ghareb Wind Project after EPC deal with POWERCHINA","url":"https://www.zawya.com/en/economy/north-africa/egypt-infinity-power-breaks-ground-on-200-mw-ras-ghareb-wind-project-after-epc-deal-with-powerchina-dd1k6k42","image_url":"https://static.zawya.com/view/acePublic/alias/contentid/39f924b9-1d04-4082-be46-8be1d955b666/48/1636799191.jpeg?f=3%3A2","published_at":"Thu, 04 Dec 2025 03:07:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSENERGYEGYPTNORTH AFRICACOMMODITIESSUSTAINABILITYINFRASTRUCTURETECHNOLOGYPOWERRENEWABLE ENERGYRELATED COMPANIESCentral EPCPHOTOArab Finance: Infinity Power, Africa’s largest renewable energy provider, has started construction on the 200-megawatt Ras Ghareb Wind Project in Egypt’s Gulf of Suez after signing an engineering, procurement, and construction (EPC) contract with POWERCHINA Huadong Engineering Corporation Limited (HDEC), as per a press release. The agreement was signed at the China-Africa Economic, Trade, and Cultural Forum by Co-Founder and CEO of Infinity Power Nayer Fouad and Vice President of POWERCHINA HDEC Liu Jiajin. The Ras Ghareb wind farm is part of Egypt’s renewable energy program and the European Bank for Reconstruction and Development-led Energy Pillar of the National Water, Food, and Energy (NWFE) initiative. Once completed, the project is expected to supply electricity to more than 300,000 homes and reduce carbon emissions by over 400,000 tons a year, supporting Egypt’s plans to expand low-carbon power generation. The project also contributes to Infinity Power’s goal of operating 10 gigawatts of renewable energy across Africa by 2030, which the company estimates would provide electricity to around 12 million homes. “We continue to make strong progress towards our 2030 capacity target, and this project marks another important milestone in that journey. It shows that large-scale renewable projects in Africa are becoming a reality on the groun","tickers":[]},{"title":"CIB named Egypt’s Bank of the Year 2025 as factoring portfolio hits $84.4mln","url":"https://www.zawya.com/en/business/banking-and-insurance/cib-named-egypts-bank-of-the-year-2025-as-factoring-portfolio-hits-844mln-r6m8n453","image_url":"https://static.zawya.com/view/acePublic/alias/contentid/image.171219080610JQRC/28/171219080610jqrc-jpg.jpeg?f=3%3A2","published_at":"Fri, 05 Dec 2025 00:31:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSEGYPTFINANCIAL SERVICESPHOTOEgypt - Commercial International Bank (CIB) has secured The Banker’s Bank of the Year 2025 award for Egypt, cited for the rapid expansion of its factoring subsidiary and the broadening of its sustainable lending to small and medium-sized enterprises (SMEs). The bank’s wholly owned factoring subsidiary, Commercial International Finance Company (CIFC), recorded a portfolio exceeding EGP 4 billion ($84.4 million) by the end of June 2025, following its launch in early 2024. The unit reported outstanding balances of EGP 2.1 billion and aims to expand its operations through integrated supply chain management solutions. In July 2024, CIB introduced a “Sustainable Finance Loan” designed to support SMEs in the textile, plastic, and food and beverage sectors. The product, developed in partnership with the Deutsche Gesellschaft für Internationale Zusammenarbeit (GIZ) and the Frankfurt Business School, assists clients in upgrading fixed assets and investing in renewable energy and resource efficiency. To further support local businesses, the bank signed a credit risk guarantee agreement with the European Bank for Reconstruction and Development (EBRD) in November 2024. The deal covers 50 per cent of the credit risk associated with a €50 million SME loan portfolio. “This prestigious accolade underscores our commitment to sustainable finance, digital transformation and innovative customer-centric solutions,” said Islam Zekry, group chief financial o","tickers":["COMI.CA"]},{"title":"Egypt’s One Circle Project demonstrates the viability of circular ICT","url":"https://www.zawya.com/en/press-release/companies-news/egypts-one-circle-project-demonstrates-the-viability-of-circular-ict-m83m7oj1","image_url":"https://static.zawya.com/view/acePublic/alias/contentid/0d0db8bb-c34c-49bf-b217-ffbd1e24dab9/0/1000396811-jpg.jpeg?f=3%3A2","published_at":"Thu, 04 Dec 2025 03:59:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSWASTE & RECYCLINGRELATED COMPANIESRaya HldgNokiaTelecom EgyptOrange GroupDsvCordon Bleu DusiPHOTO After Two Years of Tangible Results Egypt’s One Circle Project Announces Its Roadmap to 2026 in Partnership with UNIDO, the European Union, and the Government of Finland in partnership with Orange Group, Nokia and Cordon Egypt’s One Circle Project Demonstrates the Viability of Circular ICT: Celebrating Partnerships with UNIDO, the European Union, the Government of Finland and Launching the Next Phase One Circle Delivers a Transformative Impact: 1,300 Refurbished Smartphones and 10.22 Tons of E-Waste Processed Through Formal Channels After two years under SWITCH2CE, One Circle has moved circular ICT in Egypt from concept to practice, delivering repair, formal e-waste systems, and sustainable skills. Cairo — The United Nations Industrial Development Organization (UNIDO), the Delegation of the European Union to Egypt, the Government of Finland, and the Ministry of Industry, together with leading technology partners including Orange Group, Nokia, and Cordon, are celebrating the progress of the One Circle pilot since its launch in 2023. The event also announces the next steps of the initiative, including its expansion, new strategic partnerships, and the roadmap toward 2026. Held in Cairo under the title “One Circle – Milestones of Change,” the event highlights the profound transformation achieved by the project in shifting circularity in the ICT sector from a theoretica","tickers":["ETEL.CA"]},{"title":"Egypt, Bulgaria sign joint committee protocol to expand cooperation across 19 sectors","url":"https://www.zawya.com/en/economy/north-africa/egypt-bulgaria-sign-joint-committee-protocol-to-expand-cooperation-across-19-sectors-tjjgcejs","image_url":"https://static.zawya.com/view/acePublic/alias/contentid/870160b8-7f60-497a-88a6-fb0968989390/80/1080377280.jpeg?f=3%3A2","published_at":"Thu, 04 Dec 2025 22:33:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSEGYPTNORTH AFRICABULGARIATECHNOLOGYENERGYTRANSPORTMANUFACTURINGAUTOMOTIVEPOWERPHARMACEUTICALRENEWABLE ENERGYTAXATIONCHEMICALECONOMYPHOTO Arab Finance: Egypt and Bulgaria inked a protocol to strengthen cooperation in 19 economic, technical, and development sectors during the meetings of the Egyptian-Bulgarian Joint Committee for Economic, Scientific, and Technical Cooperation, held in the New Capital, as per a statement. The committee was co-chaired by Minister of Planning and Economic Development, and International Cooperation Rania Al-Mashat and Bulgaria’s Minister of Economy and Industry Petar Dilov. Both sides said the protocol reflects their intention to advance economic dialogue and develop mutually beneficial cooperation. They agreed to work on elevating bilateral coordination in line with the partnership between Egypt and the European Union (EU). Al-Mashat noted that convening the joint committee ahead of the 100th anniversary of diplomatic relations provides opportunities for cooperation by drawing on the capabilities of both countries. She said the protocol covers sectors that serve shared priorities, particularly in industry, investment, and business engagement. The protocol aims to expand economic and trade cooperation, building on bilateral trade that reached about $1 billion in 2024. Egypt and Bulgaria agreed to encourage business participation through forums, exhibitions, and business-to-business (B2B) meetings, and to activate cooperation between ","tickers":[]},{"title":"AEEDC Dubai 2026: Egypt takes center stage as guest of honour","url":"https://www.zawya.com/en/press-release/events-and-conferences/aeedc-dubai-2026-egypt-takes-center-stage-as-guest-of-honour-o3660v9u","image_url":"https://static.zawya.com/view/acePublic/alias/contentid/bb15ea1d-06be-426b-ae4c-e2d78b926afd/0/whatsappimage2025-12-04at11-57-23am-jpeg.jpeg?f=3%3A2","published_at":"Thu, 04 Dec 2025 03:25:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSHEALTHCARERELATED COMPANIESREED EXHIBITIONSEgyptPHOTOCairo, Arab Republic of Egypt — The UAE International Dental Conference and Arab Dental Exhibition (AEEDC Dubai) announced the selection of the Arab Republic of Egypt as the Guest of Honour for the 30th edition of AEEDC Dubai, scheduled to take place from 19 to 21 January 2026 at the Dubai World Trade Centre. AEEDC Dubai is the world’s largest annual scientific dental conference and exhibition, continuing to solidify its role as a leading platform for scientific exchange, professional development, and international cooperation in the dental sector. Egypt’s selection as Guest of Honour for the 2026 edition underscores the country’s prominent position within the regional healthcare landscape, as well as its longstanding participation in AEEDC Dubai. Egyptian universities, medical institutions, and manufacturers have consistently contributed to the event’s scientific sessions, research activities, and exhibition pavilions. Last year’s edition of AEEDC Dubai welcomed over 85,000 visitors and participants from 177 countries, and recorded notable business deals exceeding AED 20 billion, laying a strong foundation for the milestone 30th edition. H.E. Ambassador Dr. Abdul Salam Al Madani, Ambassador of the Parliamentary Assembly of the Mediterranean for the GCC Region, Chairman of AEEDC Dubai and of the Global Scientific Dental Alliance (GSDA), said: “The 30th edition marks three decades of scientific progress, global","tickers":[]},{"title":"Egypt: El-Khatib opens EGX trading session as Egytrans completes NOSCO acquisition","url":"https://www.zawya.com/en/economy/north-africa/egypt-el-khatib-opens-egx-trading-session-as-egytrans-completes-nosco-acquisition-rcl4fb30","image_url":"https://static.zawya.com/view/acePublic/alias/contentid/6a8a2d52-6c6e-4e0f-a210-dac61c2c77eb/84/1324187713.jpeg?f=3%3A2","published_at":"Thu, 04 Dec 2025 22:34:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICS ACQUISITIONEGYPTNORTH AFRICAEQUITIESTECHNOLOGYEQUITIESPHOTO Arab Finance: Minister of Investment and Foreign Foreign Trade Hassan El-Khatib took part in the bell-ringing ceremony to open Tuesday’s trading session at the Egyptian Exchange (EGX), marking the completion of the Egyptian Transport and Commercial Services Company's (Egytrans) acquisition of the National Transport and Overseas Services Co. (NOSCO), as per a statement. El-Khatib said that recent developments in the EGX indicate the capital market’s ability to offer financial instruments that support companies’ growth plans and improve market performance. He added that the state is working to strengthen the institutional framework of the capital market through updated rules and tools that increase investment appeal. The minister also noted that the performance of the exchange reflects the performance of the economy, explaining that improvements point to the direction of current economic trends. Moreover, he outlined the government’s reliance on four core policy pillars—fiscal, monetary, trade, and state ownership—when shaping its economic approach. El-Khatib stated that the ongoing work represents a step in modernising the capital market, and that Egypt aims to advance toward the top 50 countries globally in capital market indicators and economic competitiveness. He pointed out this goal is underway and that international comparisons show Egypt is progressing at a measured pace. © 2025 All Rights Reserv","tickers":["EGX"]},{"title":"Egypt's gold prices edge lower on Thursday","url":"https://www.zawya.com/en/economy/north-africa/egypts-gold-prices-edge-lower-on-thursday-i0tl6d7l","image_url":"https://static.zawya.com/view/acePublic/alias/contentid/f99bfa74-c2a9-4263-a7b0-6684e69724c0/28/global-precious-gold.jpeg?f=3%3A2","published_at":"Thu, 04 Dec 2025 22:37:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSCOMMODITIESEGYPTNORTH AFRICAGOLDPHOTO Arab Finance: The gold prices in Egypt dropped on Thursday, Dahab Masr’s data showed at 3:29 pm. The 24-karat gold price hit EGP 6,427.93 per gram for buying and EGP 6,376.51 for selling. Likewise, the 21-karat gold price declined to EGP 5,625 per gram for purchasing and EGP 5,580 for selling. The international gold ounce price amounted to $4,192.5 for buying and $4,191.7 for selling. © 2025 All Rights Reserved Arab Finance For Information Technology Provided by SyndiGate Media Inc. (Syndigate.info).Disclaimer: The content of this article is syndicated or provided to this website from an external third party provider. We are not responsible for, and do not control, such external websites, entities, applications or media publishers. The body of the text is provided on an “as is” and “as available” basis and has not been edited in any way. Neither we nor our affiliates guarantee the accuracy of or endorse the views or opinions expressed in this article. Read our full disclaimer policy here. © ZAWYA 2025","tickers":[]},{"title":"Ezz Elarab Group unveils the Ferrari 12Cilindri in Egypt for the first time","url":"https://www.zawya.com/en/press-release/companies-news/ezz-elarab-group-unveils-the-ferrari-12cilindri-in-egypt-for-the-first-time-jypoakr8","image_url":"https://static.zawya.com/view/acePublic/alias/contentid/ffcf97f7-bba8-44c9-a0d1-67a6bec2f1a9/1/3-12-2025ferrari-143-jpg.jpeg?f=3%3A2","published_at":"Wed, 03 Dec 2025 20:55:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSAUTOMOTIVERELATED COMPANIESFerrariEzz Elarab AutomPHOTOCairo, Egypt: Ezz Elarab Group, the official importer of Ferrari in Egypt, has officially introduced the Ferrari 12Cilindri to the Egyptian market for the very first time. The reveal took place during an exclusive launch event held at the Giza Palace Hotel & Spa, marking a milestone that brings Ferrari’s latest V12 innovation and hallmark Italian performance to local enthusiasts. This debut reflects the growing demand for ultra-luxury vehicles in Egypt and underscores the Group’s commitment to bringing Ferrari’s newest global models directly to its customers. Representing a new chapter in Ferrari’s eight-decade legacy of V12 engineering, the Ferrari 12Cilindri blends remarkable power with timeless design inspired by the brand’s iconic GT heritage. Powered by a naturally aspirated 6.5-liter engine delivering 819 hp at 9,500 rpm, the car accelerates from 0 to 100 km/h in approximately 2.9 seconds and reaches a top speed exceeding 340 km/h. Its advanced dynamics package, including four-wheel steering, carbon-ceramic brakes, active aerodynamics, and magnetic suspension ensures exceptional stability, responsiveness, and driving precision. Designed at Ferrari’s Styling Center under the direction of Flavio Manzoni, the exterior captures a futuristic interpretation of the golden era of GTs, drawing inspiration from the legendary Daytona. The model’s distinctive form earned it the Compasso d’Oro Award 2025, celebrati","tickers":[]},{"title":"Egypt to swap capital gains for stamp duty to boost stock market investment","url":"https://www.zawya.com/en/capital-markets/equities/egypt-to-swap-capital-gains-for-stamp-duty-to-boost-stock-market-investment-mxpkajic","image_url":"https://static.zawya.com/view/acePublic/alias/contentid/bf6eefa6-b769-43ab-bee5-2eaa17e5bb03/38/1449315260.jpeg?f=3%3A2","published_at":"Wed, 03 Dec 2025 19:38:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSMARKETSTAXATIONEGYPTEQUITIESPHOTOEgypt plans to replace capital gains tax with a stamp duty to stimulate institutional investment in the stock exchange, Finance Minister Ahmed Kouchouk announced on Wednesday, as part of a second package of tax facilities aimed at supporting the business community. Speaking at a weekly press conference in the New Administrative Capital, Kouchouk outlined an “integrated strategy” to ease burdens on taxpayers, which includes cutting Value Added Tax (VAT) on medical devices and exempting transit trade from levies. The minister stated that the government would shift to a stamp duty system instead of capital gains tax to incentivise institutional investment in the Egyptian Exchange. Additionally, the ministry will coordinate with the Financial Regulatory Authority to grant tax benefits to companies listing on the bourse for a period of three years, provided there is a tangible improvement in trading volumes. In a move to support the healthcare sector, Kouchouk announced new legislation to reduce VAT on medical devices to 5% from the current 14%. The package also includes a full VAT exemption for components and supplies used in dialysis and kidney filters. To further encourage investment, the suspension period for VAT payment on machinery and medical equipment will be extended to four years. The package also targets the logistics sector, with legislative amendments planned to ensure VAT is not applied to goods in transit or related ser","tickers":[]},{"title":"Egypt, Tunisia hold fourth meeting to advance investment cooperation","url":"https://www.zawya.com/en/economy/north-africa/egypt-tunisia-hold-fourth-meeting-to-advance-investment-cooperation-a6e3sm0r","image_url":"https://static.zawya.com/view/acePublic/alias/contentid/c7dfbebf-1f2c-44f8-a543-927d9d9fcbfa/65/1427102562.jpeg?f=3%3A2","published_at":"Thu, 04 Dec 2025 00:53:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSEGYPTNORTH AFRICATUNISIARENEWABLE ENERGYENERGYINFRASTRUCTURETECHNOLOGYINVESTMENTPHOTOArab Finance: The General Authority for Investment and Free Zones (GAFI) hosted the fourth meeting of the Egyptian-Tunisian Technical Committee for Investment Cooperation over three days, continuing efforts to activate the memorandum of understanding (MoU) signed between the two countries in May 2022, as per a statement. The sessions were chaired by Executive Vice President of GAFI Yasser Abbas, and Director General of the Foreign Investment Promotion Agency in Tunisia Jalal Al-Tabib. Abbas said the cooperation reflects the longstanding ties between Egypt and Tunisia and the shared goal of attracting investment to support economic development. He highlighted the commitment of both sides to address challenges in the investment ecosystem and expand technical knowledge exchange to improve the overall climate. He also encouraged Tunisian investors to explore opportunities in Egypt, emphasizing the Authority’s readiness to provide support, particularly as digital transformation efforts expand. Al-Tabib thanked the Egyptian side for its reception and stressed the importance of working jointly to increase investment flows and open new avenues for sustainable development. Discussions covered key reforms implemented by Egypt to improve the business environment, including updates to economic legislation, infrastructure development, and the approval of the State Property Policy document. T","tickers":[]},{"title":"E& Egypt renews partnership with Viu to provide exclusive entertainment content for its premium customers.","url":"https://www.zawya.com/en/press-release/companies-news/e-and-egypt-renews-partnership-with-viu-to-provide-exclusive-entertainment-content-for-its-premium-customers-ex287qsp","image_url":"https://static.zawya.com/view/acePublic/alias/contentid/cb43a9a7-85b3-474f-890a-4e3ef8891322/0/a307cb14-8d99-4bd5-bd82-ad708594b1b6-jfif.jpeg?f=3%3A2","published_at":"Thu, 04 Dec 2025 03:59:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSTELECOMPHOTOCairo – e& Egypt, a leading company in the integrated telecommunications and technology sector, announced a renewal of its strategic partnership with the digital entertainment platform Viu to offer an exclusive library of top Arabic films, Korean content, and Asian series to Emerald, Hekaya, Ahlan, e& Money, e& coins program and e& Business customers. The announcement was made during GITEX Global 2025 in Dubai. The decision to renew this partnership reflects e& Egypt’s strong commitment to its customers, who highly valued the features and benefits offered during the initial collaboration. e& firmly believes that customer satisfaction is of paramount importance and remains at the core of its business approach. This step is also part of e& Egypt’s strategy to expand its digital and entertainment services, catering to diverse interests and tastes while enhancing the added value of its premium offerings. Through this partnership, customers of Emerald, Hekaya, Ahlan, e& Money, e& coins program and e& Business will gain exclusive access to a vast library of Arabic and Asian content, enjoying a seamless, high-quality viewing experience. Samer Mourad, Chief Consumer Officer at e& Egypt, said: \"We are committed to providing the best entertainment experiences to our customers, and our partnership with Viu adds significant value to our service portfolio.\" He reaffirmed e& Egypt’s commitment to driving digital transformation by offering innovative solutions that","tickers":[]},{"title":"Egypt, Greece launch first joint business forum in bid to deepen investment ties","url":"https://www.zawya.com/en/economy/north-africa/egypt-greece-launch-first-joint-business-forum-in-bid-to-deepen-investment-ties-uiv8bvo2","image_url":"https://static.zawya.com/view/acePublic/alias/contentid/image.180723102024ZAFZ/121/180723102024zafz-jpg.jpeg?f=3%3A2","published_at":"Thu, 04 Dec 2025 01:06:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSEGYPTGREECENORTH AFRICAPOWERTECHNOLOGYENERGYINVESTMENTPHOTOArab Finance: Egypt and Greece opened a new phase of economic engagement as the General Authority for Investment and Free Zones (GAFI) witnessed the launch of the first Egyptian-Greek Business and Investment Forum under the theme “Building Bridges for Shared Prosperity,” as per a statement. The meeting brought together Yasser Abbas, Executive Vice President of GAFI, and Harry Theoharis, Deputy Minister of Foreign Affairs of Greece, alongside representatives from several Egyptian ministries and major companies from both countries. Abbas said the forum marks a practical step toward strengthening economic partnership and expanding cooperation across trade, investment, industry, tourism, and technology. He underlined the growing role of the private sector in advancing activity between the two sides. He added that cooperation between Egypt and Greece is entering a new phase, driven by a shared focus on African markets. He noted that Egypt’s position as a gateway for exports to the continent, along with its membership in the African Continental Free Trade Area, offers Greek companies access to a significant consumer base. Economic relations have already shown clear progress, Abbas said, pointing to nearly $2 billion in trade between the two countries and more than 200 Greek companies operating in Egypt. He highlighted the GREGY electricity interconnection project as one of the most significant joint initiative","tickers":[]},{"title":"Egypt signs license agreement with Honeywell UOP for sustainable aviation fuel project","url":"https://www.zawya.com/en/economy/north-africa/egypt-signs-license-agreement-with-honeywell-uop-for-sustainable-aviation-fuel-project-x5ue23p8","image_url":"https://static.zawya.com/view/acePublic/alias/contentid/6ff295d2-b98a-4401-8241-e5f24721695d/15/1370918272.jpeg?f=3%3A2","published_at":"Thu, 04 Dec 2025 22:25:00 GMT","source":"Zawya","country":"EG","market":"EGX","content":"RELATED TOPICSOILEGYPTNORTH AFRICASUSTAINABILITYOIL AND GASENERGYTECHNOLOGYPETROCHEMICALSCOMMODITIESAVIATIONPHOTO Arab Finance: Egypt’s Ministry of Petroleum and Mineral Resources signed a production license agreement with Honeywell UOP for the country’s first sustainable aviation fuel (SAF) project, marking a new step in efforts to lower emissions and expand green energy initiatives, as per a statement. The agreement was signed between the Egyptian Petrochemicals Holding Company—represented by the Egyptian Sustainable Aviation Fuel Company (ESAF)—and Honeywell UOP, in the presence of Minister of Petroleum and Mineral Resources Karim Badawi. Following the signing, Badawi said the project is the first of its kind in Egypt and supports the state's direction toward green energy by helping reduce emissions from the aviation sector through the production of sustainable jet fuel. He noted that the facility, to be built in Alexandria, will convert used cooking oil into jet fuel with an annual capacity of up to 120,000 tons, helping cut around 400,000 tons of carbon dioxide emissions per year. He described the project as a priority given its economic and environmental returns. Khaled Hashem, President of Honeywell Middle East and Africa, said Honeywell values its partnership with the ministry and the Egyptian Petrochemicals Holding Company, adding that the cooperation reflects shared confidence and a commitment to adopting technologies that support the shift to low-carbon fuels. He s","tickers":[]},{"title":"Egypt’s non-oil private sector records strong growth in November as PMI hits 5-year high","url":"https://arabfinance.com/en/news/newdetails/egypt-non-oil-private-sector-records-strong-growth-in-november-pmi-hits-5-year-high","published_at":"Tue, 02 Dec 2025 22:11:00 GMT","source":"Arab Finance","country":"EG","market":"EGX","content":"Copy to clipboard Tags Egypt PMI Non-oil private sector Egyptian economy Related News © 2025 All Rights Reserved Arab Finance For Information Technology","tickers":[]},{"title":"AOI signs contract with France’s Dassault to strengthen defense-industry partnership","url":"https://arabfinance.com/en/news/newdetails/aoi-signs-contract-with-french-dassault-to-strengthen-defense-industry-partnership","published_at":"Tue, 02 Dec 2025 04:59:00 GMT","source":"Arab Finance","country":"EG","market":"EGX","content":"Copy to clipboard Tags Egypt Cooperation France Egypt Defence Expo Related News © 2025 All Rights Reserved Arab Finance For Information Technology","tickers":[]},{"title":"Digital Egypt platform expands services, user base in 2025","url":"https://arabfinance.com/en/news/newdetails/digital-egypt-platform-expands-services-and-user-base-in-2025","published_at":"Tue, 02 Dec 2025 23:36:00 GMT","source":"Arab Finance","country":"EG","market":"EGX","content":"Copy to clipboard Tags Egypt Platform Digital government Digital Egypt Related News © 2025 All Rights Reserved Arab Finance For Information Technology","tickers":[]},{"title":"Cabinet approves Egypt’s accession to Green Middle East Initiative","url":"https://arabfinance.com/en/news/newdetails/cabinet-approves-egypt-accession-to-green-middle-east-initiative","published_at":"Sun, 30 Nov 2025 00:13:00 GMT","source":"Arab Finance","country":"EG","market":"EGX","content":"Copy to clipboard Tags Egypt Cabinet decisions Related News © 2025 All Rights Reserved Arab Finance For Information Technology","tickers":[]},{"title":"MSMEDA supports MSMEs in Upper Egypt with EGP 28B over 11 years","url":"https://arabfinance.com/en/news/newdetails/msmeda-supports-msmes-in-upper-egypt-with-egp-28-billion-over-11-years","published_at":"Sun, 30 Nov 2025 05:04:00 GMT","source":"Arab Finance","country":"EG","market":"EGX","content":"Copy to clipboard Tags MSMEDA MSMEs Financing Upper Egypt Related News © 2025 All Rights Reserved Arab Finance For Information Technology","tickers":[]},{"title":"TMG Holding launches Yamal, Jood development projects in Oman","url":"https://arabfinance.com/en/news/newdetails/tmg-holding-launches-yamal-jood-development-projects-in-oman","published_at":"Tue, 02 Dec 2025 00:33:00 GMT","source":"Arab Finance","country":"EG","market":"EGX","content":"Copy to clipboard Tags Oman Development projects TMG Holding Related News © 2025 All Rights Reserved Arab Finance For Information Technology","tickers":["TMGH.CA"]},{"title":"NOSI raises insurable wage limits starting January 2026","url":"https://arabfinance.com/en/news/newdetails/nosi-raises-insurable-wage-limits-starting-january-2026","published_at":"Sun, 30 Nov 2025 22:04:00 GMT","source":"Arab Finance","country":"EG","market":"EGX","content":"Copy to clipboard Tags Finance Egypt Insurance Pensions Wages Related News © 2025 All Rights Reserved Arab Finance For Information Technology","tickers":[]},{"title":"Egypt unveils new incentive package to attract Australian mining investment","url":"https://arabfinance.com/en/news/newdetails/egypt-unveils-new-incentive-package-to-attract-australian-mining-investment","published_at":"Sat, 29 Nov 2025 21:57:00 GMT","source":"Arab Finance","country":"EG","market":"EGX","content":"Copy to clipboard Tags Egypt Mining Australia Related News © 2025 All Rights Reserved Arab Finance For Information Technology","tickers":[]},{"title":"Egypt’s agricultural exports reach 8.5M tons YTD","url":"https://arabfinance.com/en/news/newdetails/egypt-agricultural-exports-exceed-8-million-tons-ytd","published_at":"Sun, 30 Nov 2025 02:22:00 GMT","source":"Arab Finance","country":"EG","market":"EGX","content":"Copy to clipboard Tags Egypt Exports Ministry of Agriculture Related News © 2025 All Rights Reserved Arab Finance For Information Technology","tickers":[]},{"title":"EFG Hermes completes advisory for Cherry Trading’s IPO on Tadawul","url":"https://arabfinance.com/en/news/newdetails/efg-hermes-completes-advisory-for-cherry-trading-ipo-on-tadawul","published_at":"Mon, 01 Dec 2025 04:11:00 GMT","source":"Arab Finance","country":"EG","market":"EGX","content":"Copy to clipboard Tags EFG Hermes EFG Holding Saudi Tadawul Related News © 2025 All Rights Reserved Arab Finance For Information Technology","tickers":["TDWL","HRHO.CA"]},{"title":"Madinet Masr, Group Construction sign development agreement for Sarai project","url":"https://arabfinance.com/en/news/newdetails/madinet-masr-group-construction-sign-development-agreement","published_at":"Sun, 30 Nov 2025 23:45:00 GMT","source":"Arab Finance","country":"EG","market":"EGX","content":"Copy to clipboard Tags Madinet Masr Development projects Sarai project Related News © 2025 All Rights Reserved Arab Finance For Information Technology","tickers":[]},{"title":"Cairo Trade Declaration adopted at D-8 Trade Ministers Council","url":"https://arabfinance.com/en/news/newdetails/cairo-trade-declaration-adopted-at-d-8-trade-ministers-council","published_at":"Tue, 02 Dec 2025 03:08:00 GMT","source":"Arab Finance","country":"EG","market":"EGX","content":"Copy to clipboard Tags Agreement Trade Cairo Related News © 2025 All Rights Reserved Arab Finance For Information Technology","tickers":[]},{"title":"Majid Al Futtaim chooses FAB’s Lime to enhance experience in Egypt-based retail destinations","url":"https://english.mubasher.info/news/4532472/Majid-Al-Futtaim-chooses-FAB-s-Lime-to-enhance-experience-in-Egypt-based-retail-destinations/","image_url":"https://static.mubasher.info/File.Story_Image/95c35edaa75e1f4092df44d97766ead1/640.jpg","content":"<iframe height=\"0\" src=\"https://www.googletagmanager.com/ns.html?id=GTM-NM7L484\" style=\"display:none;visibility:hidden\" width=\"0\"></iframe> Majid Al Futtaim chooses FAB’s Lime to enhance experience in Egypt-based retail destinations Majid Al Futtaim's Rasha Azab and Lime's Ahmed Mohsen 04 December 2025 03:38 PM FAB FAB 0.73% 16.62 0.12 Cairo – Mubasher: Majid Al Futtaim has signed a strategic partnership with Lime Consumer Finance, a wholly owned entity of the UAE-listed First Abu Dhabi Bank (FAB), to introduce innovative and flexible financing solutions for customers across its destinations in Egypt. The collaboration marks an important milestone in the advancement of Egypt’s retail and financial sectors, reinforcing both companies’ roles in shaping more customer-centric and digitally enabled services, according to a press release. By downloading the Lime app, customers will have access to flexible financial solutions, including instant approvals, installment-based payments, and personalized financing plans. Starting December 2025, the partnership kicks off with a one-month cashback campaign across Mall of Egypt, City Centre Almaza, City Centre Alexandria, and City Centre Maadi. Meanwhile, the dedicated Lime kiosks inside the shopping malls will enable customers to register and receive their cashback instantly on-site, ensuring a convenient, fast, and seamless experience. Customers who pay their tuition fees using Lime at any of these destinations will receive a 15% cashback","published_at":"Thu Dec 04 15:38:17 UTC 2025","source":"Mubasher","country":"EG","market":"EGX","tickers":[]},{"title":"FABMISR generates 8% higher net profit in 9M-25 after neutralizing FX impact","url":"https://english.mubasher.info/news/4531483/FABMISR-generates-8-higher-net-profit-in-9M-25-after-neutralizing-FX-impact/","image_url":"https://static.mubasher.info/File.Story_Image/e71eeae488f5c71f81cafbb76c03d981/640.jpg","content":"<iframe height=\"0\" src=\"https://www.googletagmanager.com/ns.html?id=GTM-NM7L484\" style=\"display:none;visibility:hidden\" width=\"0\"></iframe> FABMISR generates 8% higher net profit in 9M-25 after neutralizing FX impact First Abu Dhabi Bank Misr (FABMISR) 02 December 2025 06:59 PM FAB FAB 0.73% 16.62 0.12 Cairo – Mubasher: First Abu Dhabi Bank Misr (FABMISR), the banking business of the UAE listed FAB in Egypt, has delivered strong performance in its core business operations during the first nine months (9M) of 2025, according to a press release. The bank recorded an 8% growth in net profit to EGP 13.20 billion, after neutralizing the FX impact, compared to 9M-24, which reflected high operational efficiency and the successful execution of its strategy to drive sustainable value from core operations. The positive results were further reflected in shareholders’ equity, which grew by 19% to reach EGP 71.90 billion, reinforcing a robust capital base that supports the bank’s expansion plans. According to the financial results, total assets increased by 14% to EGP 472.40 billion, while the net loans and advances grew by 24% to EGP 176.50 billion. Customer confidence also remained strong, with customer deposits rising 20% to EGP 310.8 billion, reaffirming the ability of FABMISR to attract and retain deposits in a highly competitive banking environment. Additionally, the bank generated EGP 2.40 billion in net fee and commission income, a 25% increase compared to 9M-24, reflecting the su","published_at":"Tue Dec 02 18:59:28 UTC 2025","source":"Mubasher","country":"EG","market":"EGX","tickers":[]},{"title":"Wadi Kom Ombo records lower net profits at nearly EGP 2m in Q1-25/26","url":"https://english.mubasher.info/news/4531526/Wadi-Kom-Ombo-records-lower-net-profits-at-nearly-EGP-2m-in-Q1-25-26/","image_url":"https://static.mubasher.info/File.Story_Image/bc51747f1ff7ea807c52d40bcfab6541/640.jpg","content":"<iframe height=\"0\" src=\"https://www.googletagmanager.com/ns.html?id=GTM-NM7L484\" style=\"display:none;visibility:hidden\" width=\"0\"></iframe> Wadi Kom Ombo records lower net profits at nearly EGP 2m in Q1-25/26 Photo Archive 02 December 2025 09:36 PM Wadi Kom Ombo WKOL -0.58% 312.51 -1.83 Cairo - Mubasher: The net profits after tax of Wadi Kom Ombo for Land Reclamation Company reached EGP 1.71 million in the first quarter (Q1) of fiscal year (FY) 2025/2026, marking a year-on-year (YoY) drop from EGP 15.52 million. The earnings per share (EPS) retreated to EGP 0.31 in Q1-25/26 from EGP 2.77 in the corresponding period a year earlier, according to the financial statements. Meanwhile, the continuing operating revenues totaled EGP 11.15 million in the July-September 2025 period, which signaled an annual plunge from EGP 23.90 million. The EGX-listed company posted EGP 772.28 million in total assets as of 30 September 2025, which came lower than EGP 776.71 million as of 30 June 2024. Financial Results Source: Mubasher Related News Egyptian Resorts turns to EGP 103m consolidated net profits in 9M-25 Financial Results Dice’s consolidated net profits decline to EGP 302m in 9M-25 Financial Results Cairo Housing registers 94% lower consolidated net profits in 9M-25 Real estate United Housing’s consolidated net profits exceed EGP 174.5m in 9M-25 Real estate Trending {{details.article.title}} This news story is part of Mubasher Exclusive Services. If you would like to subscribe please click","published_at":"Tue Dec 02 21:36:11 UTC 2025","source":"Mubasher","country":"EG","market":"EGX","tickers":["EGX"]},{"title":"South Valley Cement stock rises after retesting main support level","url":"https://english.mubasher.info/news/4531924/South-Valley-Cement-stock-rises-after-retesting-main-support-level/","image_url":"https://static.mubasher.info/File.Story_Image/29d9f4155296b4b4b36fb88abc038fcf/640.jpg","content":"<iframe height=\"0\" src=\"https://www.googletagmanager.com/ns.html?id=GTM-NM7L484\" style=\"display:none;visibility:hidden\" width=\"0\"></iframe> South Valley Cement stock rises after retesting main support level South Valley Cement stock rises after retesting main support level 03 December 2025 02:34 PM South Valley Cement SVCE -2.24% 6.55 -0.15 Cairo – Mubasher: Technical movements signaled by Mubasher Trade Research indicated that the stock of South Valley Cement Company has seen a strong rise during Wednesday’s trading session, accompanied by high trading volumes. During the session, the stock tested an important and pivotal support level at EGP 6 - 6.10 which was retested multiple times, indicating the concentration of buying power. The level was also supported by the moving average, which represents a moving support for the stock. During the last period, the South Valley Cement stock saw some decline, as it started to form lower highs and lower lows. The stock is currently testing a strong resistance level at EGP 6.95, while holding above this resistance supports the stock's rise to the next resistance at EGP 7.40. Meanwhile, if it fails to hold and retreats, the stock is likely to test the main support again at EGP 6 - 6.10 pounds, and trading above this support level would back a positive outlook in the medium term. In addition, the stock is about to test a downward trend line that started in late August, and breaking above it will attract more buying power to the stock. Su","published_at":"Wed Dec 03 14:34:32 UTC 2025","source":"Mubasher","country":"EG","market":"EGX","tickers":[]},{"title":"Region’s Mastercard Gateway to facilitate online transactions through new Saudi interface","url":"https://english.mubasher.info/news/4531442/Region-s-Mastercard-Gateway-to-facilitate-online-transactions-through-new-Saudi-interface/","image_url":"https://static.mubasher.info/File.Story_Image/8864a8ced70a204eea8aa0ec85b03455/640.jpg","content":"<iframe height=\"0\" src=\"https://www.googletagmanager.com/ns.html?id=GTM-NM7L484\" style=\"display:none;visibility:hidden\" width=\"0\"></iframe> Region’s Mastercard Gateway to facilitate online transactions through new Saudi interface Mastercard Gateway 02 December 2025 03:43 PM Riyadh – Mubasher: Mastercard Gateway is now certified to facilitate online transactions through the Saudi Central Bank’s (SAMA) New E-commerce Payments Interface locally and securely. This new certification will allow providing local routing, tokenization, fraud prevention, and direct integration with the national payment scheme (mada), according to a press release. Furthermore, it will contribute to the digital transformation and economic diversification in Saudi Arabia, consolidating Mastercard Gateway in the Kingdom and wider region as one of the essential tools for digital commerce innovation. The new E-commerce Payments Interface is geared towards bolstering Saudi payment infrastructure and advancing the rapidly evolving ecommerce sector. Country Manager for Saudi Arabia, Bahrain, Jordan and other Levant at Mastercard, Saud Swar, said: “Mastercard is committed to powering economies and empowering people, and we understand the importance of robust infrastructure, secure technology, smart integration and collaboration, in the quest for a thriving digital economy. With this certification, we are pleased to play our part in realizing the immense potential of ecommerce in the Kingdom.” It is worth noting ","published_at":"Tue Dec 02 15:43:36 UTC 2025","source":"Mubasher","country":"EG","market":"EGX","tickers":[]},{"title":"Prices of investment funds including certificates in EGP, USD – Update","url":"https://english.mubasher.info/news/4531798/Prices-of-investment-funds-including-certificates-in-EGP-USD-Update/","image_url":"https://static.mubasher.info/File.Story_Image/b04d3003532db7b96658a2aef4cbad26/640.jpg","content":"<iframe height=\"0\" src=\"https://www.googletagmanager.com/ns.html?id=GTM-NM7L484\" style=\"display:none;visibility:hidden\" width=\"0\"></iframe> Prices of investment funds including certificates in EGP, USD – Update Photo Archive 03 December 2025 12:05 PM Cairo – Mubasher: According to updated data, Mubasher is featuring mutual funds along with relevant prices based on the latest closing. Below you can find the names of Investment Funds as well as the price of each certificate in EGP, except for the funds of Azimut Target Maturity as well as Maksab–OZ –Fixed Income that are offered in USD, as of 2 December 2025. Fund Name: Azimut Fixed Income Fund - Idkhar AZ (az-ادخار) Price per Certificate (EGP): 19.15875 Fund Name: NI Capital Cumulative Daily Return Money Market Fund (Siula) Price per Certificate (EGP): 21.45761 Fund Name: Afaaq Investment Fund (Afaaq Fund) Price per Certificate (EGP): 231.5964 Fund Name: Azimut Equity Opportunities Fund (az-فرص) Price per Certificate (EGP): 38.81451 Fund Name: Wethaq Money Market Fund (Wethaq Investment) Price per Certificate (EGP): 20.40422 Fund Name: Azimut Fixed Income Fund - Azimut Target Maturity - USD (az–استحقاق USD) Price per Certificate (USD): 10.48994 Fund Name: Misr Takaful Islamic Sharia Compliant Fund (Misr Takaful Money Market) Price per Certificate (EGP): 185.78075 Fund Name: CI Assets Management Investment Fund (Misr Equity – CIAM) Price per Certificate (EGP): 28.20377 Fund Name: Mubasher Capital Daily Cumulative Return Fund (C","published_at":"Wed Dec 03 12:05:10 UTC 2025","source":"Mubasher","country":"EG","market":"EGX","tickers":[]},{"title":"INK PharmaSolutions strengths regional presence through collaboration with AstroLabs","url":"https://english.mubasher.info/news/4532391/INK-PharmaSolutions-strengths-regional-presence-through-collaboration-with-AstroLabs/","image_url":"https://static.mubasher.info/File.Story_Image/dd621da44a0a656843e83c6f4ee490a3/640.jpg","content":"<iframe height=\"0\" src=\"https://www.googletagmanager.com/ns.html?id=GTM-NM7L484\" style=\"display:none;visibility:hidden\" width=\"0\"></iframe> INK PharmaSolutions strengths regional presence through collaboration with AstroLabs INK PharmaSolutions and AstroLabs 04 December 2025 02:15 PM UAE – Mubasher: INK PharmaSolutions has launched in the UAE with support from AstroLabs, the Gulf’s leading business expansion platform, through an office located at the Dubai Multi Commodities Centre (DMCC). The new facility strengthens the Canada-based company’s growing presence in the UAE and the wider MENA region, according to a press release. INK PharmaSolutions operates across North America, Europe, the Middle East, and India, helping healthcare organizations navigate complex market landscapes while focusing on enabling global healthcare partnerships. This is in addition to expanding patient access through Patient Support Programs and supporting market entry and commercialization for AI, software, pharmaceutical, medical device, and healthcare technology companies seeking international growth. The new hub will enable the company to strengthen partnerships and provide localized support to organizations pursuing international growth while navigating the region’s unique operational environment. By setting up operations in the UAE, INK PharmaSolutions is poised to deliver substantial value for its partners by leveraging its extensive network and technical expertise, while significantly influenc","published_at":"Thu Dec 04 14:15:21 UTC 2025","source":"Mubasher","country":"EG","market":"EGX","tickers":[]},{"title":"World’s 1st fintech-enabled Gold ATM launches in UAE","url":"https://english.mubasher.info/news/4532008/World-s-1st-fintech-enabled-Gold-ATM-launches-in-UAE/","image_url":"https://static.mubasher.info/File.Story_Image/f667e851d961ccdfbbe52d20e71b3085/640.jpg","content":"<iframe height=\"0\" src=\"https://www.googletagmanager.com/ns.html?id=GTM-NM7L484\" style=\"display:none;visibility:hidden\" width=\"0\"></iframe> World’s 1st fintech-enabled Gold ATM launches in UAE Photo Gallery 03 December 2025 05:08 PM UAE – Mubasher: Emirates Gold has teamed up with Public Gold, Malaysia’s leading fintech-driven gold solutions provider, to launch the world’s first fintech-enabled Gold ATM in the UAE in a step that marks a major innovation milestone for both the Arab country and the global gold industry. The first ATM will be introduced at Almas Tower, with additional units planned across key destinations in the UAE, according to a press release. Emirates Gold which is one of the UAE’s most trusted and established precious metals refineries, in its collaboration with Public Gold, will deploy between 35 and 40 Gold ATM units across the country in 2026, forming the region’s largest network of its kind. Each ATM can hold over 70 designs of gold and silver bars, offering users convenient access to purchase bullion at any time while operating 24/7. Moreover, the smart Gold ATM integrates digital payments, bullion dispensing, and advanced security features into one seamless platform. Users can currently purchase gold or silver using e-wallets or credit cards, and withdraw physical bullion from their digital accounts, with additional features such as online order collection, cryptocurrency conversion, and redeeming tokenized gold from secure vaults planned for future i","published_at":"Wed Dec 03 17:08:10 UTC 2025","source":"Mubasher","country":"EG","market":"EGX","tickers":[]},{"title":"DEWA’s Moro Hub joins PwC Middle East to drive tech initiatives across region","url":"https://english.mubasher.info/news/4531946/DEWA-s-Moro-Hub-joins-PwC-Middle-East-to-drive-tech-initiatives-across-region/","image_url":"https://static.mubasher.info/File.Story_Image/3a7bfae32d67ba2163aa83ef009831cb/640.jpg","content":"<iframe height=\"0\" src=\"https://www.googletagmanager.com/ns.html?id=GTM-NM7L484\" style=\"display:none;visibility:hidden\" width=\"0\"></iframe> DEWA’s Moro Hub joins PwC Middle East to drive tech initiatives across region Moro Hub and PwC Middle East 03 December 2025 02:50 PM DEWA DEWA 0.36% 2.78 0.01 Dubai – Mubasher: Moro Hub, a subsidiary of Digital DEWA, the digital arm of Dubai Electricity and Water Authority (DEWA), has entered into a strategic collaboration with PwC Middle East to advance the development and implementation of tech initiatives across the region, according to a press release. The partnership includes Smart City, Integrated Command Centre (ICC), Critical Infrastructure Monitoring, and Internet of Things (IoT) by a way of integrating Moro Hub’s advanced digital infrastructure and IoT capabilities with PwC’s global expertise in digital trust, smart city strategy, and cybersecurity. The CEO of Moro Hub, Mohammed bin Sulaiman, said: “Our collaboration with PwC Middle East represents a major step forward in our mission to build smarter, more secure, and connected communities.” Sulaiman added: “By combining PwC’s strategic and technological expertise with our integrated digital ecosystem, we can help public and private sector organizations fast-track their transformation journeys and unlock greater value from their digital investments.” The collaboration with PwC Middle East will complement these capabilities through strategic advisory, digital implementation frame","published_at":"Wed Dec 03 14:50:40 UTC 2025","source":"Mubasher","country":"EG","market":"EGX","tickers":[]},{"title":"Prices of investment funds including certificates in EGP, USD – Update","url":"https://english.mubasher.info/news/4532343/Prices-of-investment-funds-including-certificates-in-EGP-USD-Update/","image_url":"https://static.mubasher.info/File.Story_Image/b04d3003532db7b96658a2aef4cbad26/640.jpg","content":"<iframe height=\"0\" src=\"https://www.googletagmanager.com/ns.html?id=GTM-NM7L484\" style=\"display:none;visibility:hidden\" width=\"0\"></iframe> Prices of investment funds including certificates in EGP, USD – Update Photo Archive 04 December 2025 12:24 PM Cairo – Mubasher: According to updated data, Mubasher is featuring mutual funds along with relevant prices based on the latest closing. Below you can find the names of Investment Funds as well as the price of each certificate in EGP, except for the funds of Azimut Target Maturity as well as Maksab–OZ –Fixed Income that are offered in USD, as of 3 December 2025. Fund Name: Azimut Fixed Income Fund - Idkhar AZ (az-ادخار) Price per Certificate (EGP): 19.16598 Fund Name: NI Capital Cumulative Daily Return Money Market Fund (Siula) Price per Certificate (EGP): 21.46893 Fund Name: Afaaq Investment Fund (Afaaq Fund) Price per Certificate (EGP): 231.7187 Fund Name: Azimut Equity Opportunities Fund (az-فرص) Price per Certificate (EGP): 39.24771 Fund Name: Wethaq Money Market Fund (Wethaq Investment) Price per Certificate (EGP): 20.4171 Fund Name: Azimut Fixed Income Fund - Azimut Target Maturity - USD (az–استحقاق USD) Price per Certificate (USD): 10.49238 Fund Name: Misr Takaful Islamic Sharia Compliant Fund (Misr Takaful Money Market) Price per Certificate (EGP): 185.87957 Fund Name: CI Assets Management Investment Fund (Misr Equity – CIAM) Price per Certificate (EGP): 28.51116 Fund Name: Mubasher Capital Daily Cumulative Return Fund (Ca","published_at":"Thu Dec 04 12:24:01 UTC 2025","source":"Mubasher","country":"EG","market":"EGX","tickers":[]}]